./ ADD NAME=LBDPSDOC 0102-16272-16306-0945-00004-00006-00000-TRIDJK  02
                                                              LBD AUG16
Lionel Dyck changed the PDS point-and-shoot panels below with his
dynamic style of point-and-shoot headers. This update is optional.
Contact Lionel for more information.  lbdyck@gmail.com

./ ADD NAME=P86FNFN  0109-01347-16221-1015-00099-00084-00000-T311LBD 52
)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
   $ type(output) intens(high) caps(off) just(asis) pas(on) hilite(uscore)
)BODY EXPAND(\\)
+-\-\-¢PDS Function Selection+-\-\-
%OPTION  ===>_ZCMD
+
+
 Choose one of the following (point-and-shoot):
+
    $FUNCTION+- Display function status and selection panel
    $SHOW    +- View log prompt
    $VL      +- View log
    $MEMLIST +- Member list  (ML for short)
    $LISTA   +- List allocation prompt
    $LA      +- Switch to LISTA display
    $LISTC   +- List file prompt
    $LISTF   +- List file prompt
    $LC      +- Switch to LISTC/LISTF display
    $LF      +- Switch to LISTC/LISTF display
    $LISTV   +- List volume prompt
    $LV      +- Switch to LISTV display
    $CAX     +- Switch to CAX display  (Active catalog list)
    $TCT     +- Switch to TCT display  (TSO command table)
    $CANCEL  +- Cancel pending line command prompt (CAN for short)
    $QUIT    +- Terminate¢PDS+ (Q for short)
)INIT
 .HELP = P86FN@PH
 &FUNCTION = 'FUNCTION'
 &SHOW    =  'SHOW'
 &VL      =  '8'
 &MEMLIST  = 'MEMLIST'
 &LISTA   =  'LISTA'
 &LA      =  'LA'
 &LISTC   =  'LISTC'
 &LISTF   =  'LISTF'
 &LC      =  'LC'
 &LF      =  'LF'
 &LISTV   =  'LISTV'
 &LV      =  'LV'
 &CAX     =  'CAX'
 &TCT     =  'TCT'
 &CANCEL  =  'CANCEL'
 &QUIT    =  'QUIT'
)PROC
 &PDSZSEL=TRANS(TRUNC(&ZCMD,'.')
         LISTV,'PANEL(P86LVLTV)'
            LV,'LISTV'
         LISTA,'PANEL(P86LALTA)'
            LA,'LISTA'
         LISTF,'PANEL(P86LCLTC)'
            LF,'LISTF'
         LISTC,'PANEL(P86LCLTC)'
            LC,'LISTC'
            ML,'ML'
          MEML,'MEMLIST'
       MEMLIST,'MEMLIST'
           CAX,'CAX'
           TCT,'TCT'
             8,8
            SH,'PANEL(P86VIVI)'
           SHO,'PANEL(P86VIVI)'
          SHOW,'PANEL(P86VIVI)'
            FU,'FUNCTION'
          FUNC,'FUNCTION'
      FUNCTION,'FUNCTION'
        CANCEL,'PANEL(P86FUCN)'
           CAN,'PANEL(P86FUCN)'
             Q,'QUIT'
            QU,'QUIT'
           QUI,'QUIT'
          QUIT,'QUIT'
           ' ',' '
             *,'?')
 &ZTRAIL=.TRAIL
 &OPERS=.TRAIL
)PNTS
FIELD(FUNCTION) VAR(ZCMD) VAL(FUNCTION)
FIELD(SHOW    ) VAR(ZCMD) VAL(SHOW    )
FIELD(VL      ) VAR(ZCMD) VAL(8       )
FIELD(MEMLIST ) VAR(ZCMD) VAL(MEMLIST )
FIELD(LISTA   ) VAR(ZCMD) VAL(LISTA   )
FIELD(LA      ) VAR(ZCMD) VAL(LA      )
FIELD(LISTC   ) VAR(ZCMD) VAL(LISTC   )
FIELD(LISTF   ) VAR(ZCMD) VAL(LISTF   )
FIELD(LC      ) VAR(ZCMD) VAL(LC      )
FIELD(LF      ) VAR(ZCMD) VAL(LF      )
FIELD(LISTV   ) VAR(ZCMD) VAL(LISTV   )
FIELD(LV      ) VAR(ZCMD) VAL(LV      )
FIELD(CAX     ) VAR(ZCMD) VAL(CAX     )
FIELD(TCT     ) VAR(ZCMD) VAL(TCT     )
FIELD(CANCEL  ) VAR(ZCMD) VAL(CANCEL  )
FIELD(QUIT    ) VAR(ZCMD) VAL(QUIT    )
)END
./ ADD NAME=P86PNDPS 0133-98282-16224-0744-00431-00038-00000-T311LBD 58
)ATTR DEFAULT(%+_)
    # TYPE(AB)    FORMAT(MIX)
    " TYPE(ABSL) GE(ON)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    ¬ TYPE(OUTPUT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
    @ TYPE(OUTPUT) INTENS(LOW)
    } TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW) SKIP(ON) HILITE(USCORE)
    $ type(output) intens(high) caps(off) just(asis) pas(on) hilite(uscore)
)ABC DESC('Memlist') MNEM(1)
PDC DESC('All Members') MNEM(13)
 ACTION RUN(MLALL)
PDC DESC('Members Updated Today') MNEM(13)
 ACTION RUN(MLTO)
PDC DESC('Members Updated Yesterday') MNEM(13)
 ACTION RUN(MLYES)
PDC DESC('Members Updated Last 7 days') MNEM(13)
 ACTION RUN(MLWE)
PDC DESC('Members Updated Last 30 days') MNEM(13)
 ACTION RUN(MLMON)
PDC DESC('Members Updated Last 90 days') MNEM(13)
 ACTION RUN(MLQTR)
PDC DESC('Members Updated Last 365 days') MNEM(13)
 ACTION RUN(MLYR)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Functions') MNEM(1)
PDC DESC('List Allocations') MNEM(6)
 ACTION RUN(LA)
PDC DESC('List Volumes...') MNEM(6)
 ACTION RUN(LV)
PDC DESC('List Files...') MNEM(6)
 ACTION RUN(LF)
PDC DESC('Active Catalog List') MNEM(3)
 ACTION RUN(CAX)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Function Menu...') MNEM(10)
 ACTION RUN(FN)
PDC DESC('Function Status') MNEM(10)
 ACTION RUN(FU)
PDC DESC('PDS TSO Command Table') MNEM(7)
 ACTION RUN(TCT)
PDC DESC('Last 30 Referenced DSNAMEs') MNEM(7)
 ACTION RUN(REFLISTD)
PDC DESC('End PDS Session') MNEM(3)
 ACTION RUN(QUIT)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Options') MNEM(1)
PDC DESC('Subcommand Selection...') MNEM(3)
 ACTION RUN(O)
PDC DESC('PDS Generation Options') MNEM(3)
 ACTION RUN(CONTAPDC)
PDC DESC('IBM System Information') MNEM(3)
 ACTION RUN(CPU)
PDC DESC('Dataset Usage') MNEM(3)
 ACTION RUN(USAGAPDC)
PDC DESC('Change Datasets') MNEM(1)
 ACTION RUN(CHANGE)
PDC DESC('Change Dataset Menu...') MNEM(2)
 ACTION RUN(CHGMENU)
PDC DESC('Michael Theys Date Calendar...') MNEM(2)
 ACTION RUN(RCQDATE)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Special') MNEM(1)
PDC DESC('Suspend ISPF') MNEM(4)
 ACTION RUN(N1)
PDC DESC('Clear Table') MNEM(5)
 ACTION RUN(N2)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N3)
PDC DESC('Sublist = Memlist') MNEM(9)
 ACTION RUN(N4)
PDC DESC('Check Aliases') MNEM(9)
 ACTION RUN(N5)
PDC DESC('MEMLIST All') MNEM(9)
 ACTION RUN(N6)
PDC DESC('Output Table...') MNEM(3)
 ACTION RUN(N7)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Swap Panels') MNEM(6)
 ACTION RUN(N9)
PDC DESC('Sort Table...') MNEM(4)
 ACTION RUN(SORTPDC)
PDC DESC('Find in Table...') MNEM(4)
 ACTION RUN(FINDPDC)
PDC DESC('Exclude All') MNEM(10)
 ACTION RUN(EXCLALL)
PDC DESC('Exclude Above') MNEM(10)
 ACTION RUN(EXCLUP)
PDC DESC('Exclude Below') MNEM(10)
 ACTION RUN(EXCLDN)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Defaults') MNEM(1)
PDC DESC('Set Environmental Options') MNEM(6)
 ACTION RUN(SETENV)
PDC DESC('Set Select Alias Commands') MNEM(6)
 ACTION RUN(SETSEL)
PDC DESC('Set Log Limit Values') MNEM(6)
 ACTION RUN(SETLOG)
PDC DESC('Set Member List Options') MNEM(6)
 ACTION RUN(SETML)
PDC DESC('Set LISTV Options') MNEM(6)
 ACTION RUN(SETV)
PDC DESC('Set LISTC Options') MNEM(6)
 ACTION RUN(SETLF)
PDC DESC('Set TRAP Options') MNEM(6)
 ACTION RUN(SETTRAP)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Help') MNEM(1)
PDC PDCTEXT('MEMLIST Load Member List')
 ACTION RUN(HELP)
PDC PDCTEXT('PDS Full-screen Help')
 ACTION RUN(TSO) PARM('HEL PDS86')
PDC PDCTEXT('PDS Tutorial Directory')
 ACTION RUN(TUTOR) PARM('P86PN@PO')
PDC PDCTEXT('PDS Quick Reference')
 ACTION RUN(QR)
PDC PDCTEXT('PDS Modifications')
 ACTION RUN(MODS)
PDC PDCTEXT('IBM Product Codes for Compilers')
 ACTION RUN(TRANS)
PDC PDCTEXT('DASD Geometry Chart')
 ACTION RUN(CONTGPDC)
PDC PDCTEXT('Undocumented Items')
 ACTION RUN(TUTOR) PARM('P86UNDOC')
PDC PDCTEXT('About PDS...')
 ACTION RUN(TUTOR) PARM('P86LOGO')
PDC PDCTEXT('PDS Birthday')
 ACTION RUN(TUTOR) PARM('P86BIRTH')
)ABCINIT
.ZVARS=ZCMD
)BODY EXPAND(\\)
%# Memlist# Functions# Options# Special# Defaults# Help+
"-------------------------------------------------------------------------------
+\ \¢MEMLIST Load Member List 3+\ \
%Command ===>¦ZCMD                                            %Scroll ===>_Z   +
Enter an ISPF command a PDS subcommand or a special control code:
%&PDSMSG  ----------------------------------------------------------------------
}CMD $name    }DATA    +ALIASOF $lenlked +  -- $attr      +  --$ac$mode+$main+
+                       MATCH   $length  $ttr      +ENTRY     SSI
)MODEL
%---- -------- -------- -------- -------- ---- ---- ---- ---- ---- ---- --------
_Z   ¬Z       _Z       @Z       @Z         @Z   @Z   @Z   @Z    @Z@Z   @Z
+                      @Z       @Z       @Z        @Z        @Z        +
)INIT
   &OPT3 = 1
   .NRET = ON
   .HELP  = P86PND@
   .ZVARS = '(ZSCBR MEMLOPT  MEMLNAME MEMLDATA MEMLALIS MEMLLDAX +
            MEMLATT1 MEMLATT2 MEMLDC   MEMLTEST MEMLAPFX MEMLMODE MEMLMNAM +
            MEMLMTTR MEMLLENG MEMLTTR MEMLENTY MEMLSSI)'
 &name    = 'NAME'
 &lenlked = 'LEN/LKED'
 &attr    = 'ATTRIBUTES'
 &ac      = 'AC'
 &mode    = 'MODE'
 &main    = 'MAIN'
 &length  = 'LENGTH'
 &ttr     = 'TTR'
)REINIT
   .NRET = ON
   REFRESH(*)
)PROC
IF (&ZCMD = 'MLALL')
  &ZCMD = 'MEMLIST :'
IF (&ZCMD = 'MLTO')
  &ZCMD = 'MEMLIST : TODAY'
IF (&ZCMD = 'MLYES')
  &ZCMD = 'MEMLIST : YESTERDAY'
IF (&ZCMD = 'MLWE')
  &ZCMD = 'MEMLIST : WEEK'
IF (&ZCMD = 'MLMON')
  &ZCMD = 'MEMLIST : MONTH'
IF (&ZCMD = 'MLQTR')
  &ZCMD = 'MEMLIST : QUARTER'
IF (&ZCMD = 'MLYR')
  &ZCMD = 'MEMLIST : YEAR'
IF (&ZCMD = 'SORTPDC')
  &ZCMD = 'SORT ?'
IF (&ZCMD = 'FINDPDC')
  &ZCMD = 'F ?'
IF (&ZCMD = 'CONTAPDC')
  &ZCMD = 'CONTROL ALL'
IF (&ZCMD = 'USAGAPDC')
  &ZCMD = 'USAGE ALL'
IF (&ZCMD = 'CONTGPDC')
  &ZCMD = 'CONTROL GEO'
IF (&ZCMD = 'EXCLALL')
  &ZCMD = 'X ALL'
IF (&ZCMD = 'EXCLUP')
  &ZCMD = 'X UP'
IF (&ZCMD = 'EXCLDN')
  &ZCMD = 'X DN'
IF (&ZCMD = 'CHGMENU')
  &ZCMD = 'O.UT.CHGMENU'
IF (&ZCMD = 'N1')
  &ZCMD = 1
IF (&ZCMD = 'N2')
  &ZCMD = 2
IF (&ZCMD = 'N3')
  &ZCMD = 3
IF (&ZCMD = 'N4')
  &ZCMD = 4
IF (&ZCMD = 'N5')
  &ZCMD = 5
IF (&ZCMD = 'N6')
  &ZCMD = 6
IF (&ZCMD = 'N7')
  &ZCMD = 7
IF (&ZCMD = 'N8')
  &ZCMD = 8
IF (&ZCMD = 'N9')
  &ZCMD = 9
IF (&ZCMD = 'NAME')
  IF (&ZPSMLL1 = '')
    &ZCMD = 'SORT NAME ASCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL1 = 1
  ELSE
    &ZCMD = 'SORT NAME DESCENDING'
    &ZPSMLL1 = ''
IF (&ZCMD = 'CREATED')
  IF (&ZPSMLL2 = '')
    &ZCMD = 'SORT LENLKED  DESCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL2 = 1
  ELSE
    &ZCMD = 'SORT LENLKED ASCENDING'
    &ZPSMLL2 = ''
IF (&ZCMD = 'LENGTH')
  IF (&ZPSMLL3 = '')
    &ZCMD = 'SORT LENGTH DESCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL3 = 1
  ELSE
    &ZCMD = 'SORT LENGTH ASCENDING'
    &ZPSMLL3 = ''
IF (&ZCMD = 'TTR')
  IF (&ZPSMLL4 = '')
    &ZCMD = 'SORT TTR ASCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL4 = 1
  ELSE
    &ZCMD = 'SORT TTR DESCENDING'
    &ZPSMLL4 = ''
IF (&ZCMD = 'LMATTR')
  IF (&ZPSMLL5 = '')
    &ZCMD = 'SORT ATTR ASCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL5 = 1
  ELSE
    &ZCMD = 'SORT ATTR DESCENDING'
    &ZPSMLL5 = ''
IF (&ZCMD = 'AUTH')
  IF (&ZPSMLL6 = '')
    &ZCMD = 'SORT AUTH ASCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL6 = 1
  ELSE
    &ZCMD = 'SORT AUTH DESCENDING'
    &ZPSMLL6 = ''
IF (&ZCMD = 'MAIN')
  IF (&ZPSMLL7 = '')
    &ZCMD = 'SORT MAIN ASCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL7 = 1
  ELSE
    &ZCMD = 'SORT MAIN DESCENDING'
    &ZPSMLL7 = ''
IF (&ZCMD = 'MODE')
  IF (&ZPSMLL8 = '')
    &ZCMD = 'SORT MODE ASCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL8 = 1
  ELSE
    &ZCMD = 'SORT MODE DESCENDING'
    &ZPSMLL8 = ''

/* Start NRETRIEV code */
VGET (ZVERB)
.NRET = OFF
IF (&ZVERB = NRETRIEV)
  .NRET = DSN
  IF (&ZNRDS = YES)
    &ZCMD = 'C &ZNRODSN'
    .MSG = ISRDS014
  ELSE .MSG = ISRDS012
/* End NRETRIEV code */

/* Start RefList code */
VGET (ZRDSN ZRVOL) SHARED
IF (&ZRDSN ¬= ' ')
  VGET (ZREFVOLM) PROFILE
  IF (&ZREFVOLM = 'ON')
    &VOL1 = &ZRVOL
  ELSE                                                  /* OW15849*/
    &VOL1 = &Z                                          /* OW15849*/
  IF (&VOL1 = ' ')
    &ZCMD = 'C &ZRDSN'
  ELSE
    &ZCMD = 'C &ZRDSN VOL(&VOL1)'
  &ZDSVOL = &VOL1
  &ZRDSN = ' '
  &ZRVOL = ' '
  VPUT (ZRDSN ZRVOL) SHARED
  VPUT (ZDSVOL) SHARED
  VGET (ZELIST) PROFILE
  IF (&ZELIST ¬= 'EXECUTE') .MSG = ISRDS003
VGET (DSALSEL) SHARED
IF (&DSALSEL ¬= ' ')
  VGET (DSA1,DSA2,DSA6,DSA7) SHARED
  IF (&DSA7 = ' ')
    &ZCMD = 'C ''&DSA1..&DSA2..&DSA6'''
  ELSE
    &ZCMD = 'C ''&DSA1..&DSA2..&DSA6'';ML &DSA7'
  &DSALSEL = ' '
  VPUT (DSALSEL) SHARED
  VGET (ZELIST) PROFILE
  IF (&ZELIST ¬= 'EXECUTE') .MSG = ISRDS003
/* End RefList code */

&PPRE = TRUNC(&ZCMD,3)
IF (&PPRE = 'c ''' OR           /* cHANGE ' command?     */
    &PPRE = 'C ''')             /* Change ' command?     */
  &PDSN = TRUNC(&ZCMD,2)
  &PDSN = .TRAIL
  &PFC = TRUNC(&PDSN,1)         /* If first character    */
  IF (&PFC = '''')              /*   of DSN is "'" check */
    &PREM = .TRAIL              /*   to see if last "'"  */
    &PREM2 = TRUNC(&PREM,'''')  /*   is missing.         */
    IF (&PREM2 = &PREM)         /* If last "'" missing   */
      &ZCMD = '&ZCMD&PFC'       /*   add it to the end.  */

&PPRE = TRUNC(&ZCMD,4)
IF (&PPRE = 'ch ''' OR          /* ch-ANGE ' command?    */
    &PPRE = 'CH ''')            /* CH-ange ' command?    */
  &PDSN = TRUNC(&ZCMD,3)
  &PDSN = .TRAIL
  &PFC = TRUNC(&PDSN,1)         /* If first character    */
  IF (&PFC = '''')              /*   of DSN is "'" check */
    &PREM = .TRAIL              /*   to see if last "'"  */
    &PREM2 = TRUNC(&PREM,'''')  /*   is missing.         */
    IF (&PREM2 = &PREM)         /* If last "'" missing   */
      &ZCMD = '&ZCMD&PFC'       /*   add it to the end.  */

&PPRE = TRUNC(&ZCMD,5)
IF (&PPRE = 'cha ''' OR         /* cha-NGE ' command?    */
    &PPRE = 'CHA ''')           /* CHA-nge ' command?    */
  &PDSN = TRUNC(&ZCMD,4)
  &PDSN = .TRAIL
  &PFC = TRUNC(&PDSN,1)         /* If first character    */
  IF (&PFC = '''')              /*   of DSN is "'" check */
    &PREM = .TRAIL              /*   to see if last "'"  */
    &PREM2 = TRUNC(&PREM,'''')  /*   is missing.         */
    IF (&PREM2 = &PREM)         /* If last "'" missing   */
      &ZCMD = '&ZCMD&PFC'       /*   add it to the end.  */
)PNTS
FIELD(name    ) VAR(ZCMD) VAL('SORT NAME')
FIELD(lenlked ) VAR(ZCMD) VAL('SORT DATE')
FIELD(attr    ) VAR(ZCMD) VAL('SORT ATTR')
FIELD(ac      ) VAR(ZCMD) VAL('SORT AUTH')
FIELD(mode    ) VAR(ZCMD) VAL('SORT MODE')
FIELD(main    ) VAR(ZCMD) VAL('SORT MAIN')
FIELD(length  ) VAR(ZCMD) VAL('SORT LENGTH')
FIELD(ttr     ) VAR(ZCMD) VAL('SORT TTR')
)END
./ ADD NAME=P86PNHPS 0145-98141-16222-0553-00291-00025-00000-T311LBD 04
)ATTR DEFAULT(%+_)
    # TYPE(AB)    FORMAT(MIX)
    " TYPE(ABSL) GE(ON)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    ¬ TYPE(OUTPUT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
    @ TYPE(OUTPUT) INTENS(LOW)
    ! TYPE(OUTPUT) INTENS(LOW) JUST(RIGHT)
    } TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW) SKIP(ON) HILITE(USCORE)
    $ type(output) intens(high) caps(off) just(asis) pas(on) hilite(uscore)
)ABC DESC('Memlist') MNEM(1)
PDC DESC('All Members') MNEM(13)
 ACTION RUN(MLALL)
PDC DESC('Members Updated Today') MNEM(13)
 ACTION RUN(MLTO)
PDC DESC('Members Updated Yesterday') MNEM(13)
 ACTION RUN(MLYES)
PDC DESC('Members Updated Last 7 days') MNEM(13)
 ACTION RUN(MLWE)
PDC DESC('Members Updated Last 30 days') MNEM(13)
 ACTION RUN(MLMON)
PDC DESC('Members Updated Last 90 days') MNEM(13)
 ACTION RUN(MLQTR)
PDC DESC('Members Updated Last 365 days') MNEM(13)
 ACTION RUN(MLYR)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Functions') MNEM(1)
PDC DESC('List Allocations') MNEM(6)
 ACTION RUN(LA)
PDC DESC('List Files...') MNEM(6)
 ACTION RUN(LF)
PDC DESC('Active Catalog List') MNEM(3)
 ACTION RUN(CAX)
PDC DESC('Memlist...') MNEM(6)
 ACTION RUN(ML)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Function Menu...') MNEM(10)
 ACTION RUN(FN)
PDC DESC('Function Status') MNEM(10)
 ACTION RUN(FU)
PDC DESC('PDS TSO Command Table') MNEM(7)
 ACTION RUN(TCT)
PDC DESC('End PDS Session') MNEM(3)
 ACTION RUN(QUIT)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Options') MNEM(1)
PDC DESC('Subcommand Selection...') MNEM(3)
 ACTION RUN(O)
PDC DESC('Change Datasets') MNEM(1)
 ACTION RUN(CHANGE)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Special') MNEM(1)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N1)
PDC DESC('Clear Table') MNEM(5)
 ACTION RUN(N2)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N3)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N4)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N5)
PDC DESC('MEMLIST All') MNEM(9)
 ACTION RUN(N6)
PDC DESC('Output Table...') MNEM(3)
 ACTION RUN(N7)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Swap Panels') MNEM(6)
 ACTION RUN(N9)
PDC DESC('Sort Table...') MNEM(4)
 ACTION RUN(SORTPDC)
PDC DESC('Find in Table...') MNEM(4)
 ACTION RUN(FINDPDC)
PDC DESC('Exclude All') MNEM(10)
 ACTION RUN(EXCLALL)
PDC DESC('Exclude Above') MNEM(10)
 ACTION RUN(EXCLUP)
PDC DESC('Exclude Below') MNEM(10)
 ACTION RUN(EXCLDN)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Defaults') MNEM(1)
PDC DESC('Set Environmental Options') MNEM(6)
 ACTION RUN(SETENV)
PDC DESC('Set Select Alias Commands') MNEM(6)
 ACTION RUN(SETSEL)
PDC DESC('Set Log Limit Values') MNEM(6)
 ACTION RUN(SETLOG)
PDC DESC('Set Member List Options') MNEM(6)
 ACTION RUN(SETML)
PDC DESC('Set LISTV Options') MNEM(6)
 ACTION RUN(SETV)
PDC DESC('Set LISTC Options') MNEM(6)
 ACTION RUN(SETLF)
PDC DESC('Set TRAP Options') MNEM(6)
 ACTION RUN(SETTRAP)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Help') MNEM(1)
PDC PDCTEXT('List Volumes Display')
 ACTION RUN(HELP)
PDC PDCTEXT('PDS Full-screen Help')
 ACTION RUN(TSO) PARM('HEL PDS86')
PDC PDCTEXT('PDS Tutorial Directory')
 ACTION RUN(TUTOR) PARM('P86PN@PO')
PDC PDCTEXT('Undocumented Items')
 ACTION RUN(TUTOR) PARM('P86UNDOC')
PDC PDCTEXT('About PDS...')
 ACTION RUN(TUTOR) PARM('P86LOGO')
PDC PDCTEXT('PDS Birthday')
 ACTION RUN(TUTOR) PARM('P86BIRTH')
)ABCINIT
.ZVARS=ZCMD
)BODY EXPAND(\\)
%# Memlist# Functions# Options# Special# Defaults# Help+
"-------------------------------------------------------------------------------
+\ \¢List Volumes+\ \
%Command ===>¦ZCMD                                            %Scroll ===>_Z   +
Enter an ISPF command or a special control code:
+  -----------------------------------------------------------------------------
}CMD $volume}  DATA  $dev1$dev2 +MOUNT$use$tfree           $large      + STATUS
+----$name  +--------$addr$type  +ATTR$cnt$cyltrke         $cyltrk     +--INDC--
)MODEL
_Z   ¬Z     _Z       @Z   @Z     @Z   @Z  !Z      !Z  @Z   !Z      !Z  @Z
)INIT
   &OPT3 = 1
   .HELP  = P86PNI@
   .ZVARS = '(ZSCBR PDSVOPT  PDSVVOL  PDSVDATA PDSVADDR PDSVTYPE +
            PDSVATTR PDSVCNT PDSVTCYL PDSVTTRK PDSVXNUM +
            PDSVLCYL PDSVLTRK PDSVINDC)'
 &volume  = 'VOLUME'
 &dev1    = 'DEV'
 &dev2    = 'DEV'
 &use     = 'USE'
 &tfree   = '---TOTAL FREE---'
 &large   = '--LARGEST--'
 &name    = ' NAME'
 &addr    = 'ADDR'
 &type    = 'TYPE'
 &cyltrke = '    CYL TRK  EXT'
 &cnt     = 'CNT'
 &cyltrk  = '    CYL TRK'
)PROC
IF (&ZCMD = 'MLALL')
  &ZCMD = 'MEMLIST :'
IF (&ZCMD = 'MLTO')
  &ZCMD = 'MEMLIST : TODAY'
IF (&ZCMD = 'MLYES')
  &ZCMD = 'MEMLIST : YESTERDAY'
IF (&ZCMD = 'MLWE')
  &ZCMD = 'MEMLIST : WEEK'
IF (&ZCMD = 'MLMON')
  &ZCMD = 'MEMLIST : MONTH'
IF (&ZCMD = 'MLQTR')
  &ZCMD = 'MEMLIST : QUARTER'
IF (&ZCMD = 'MLYR')
  &ZCMD = 'MEMLIST : YEAR'
IF (&ZCMD = 'SORTPDC')
  &ZCMD = 'SORT ?'
IF (&ZCMD = 'FINDPDC')
  &ZCMD = 'F ?'
IF (&ZCMD = 'EXCLALL')
  &ZCMD = 'X ALL'
IF (&ZCMD = 'EXCLUP')
  &ZCMD = 'X UP'
IF (&ZCMD = 'EXCLDN')
  &ZCMD = 'X DN'
IF (&ZCMD = 'N1')
  &ZCMD = 1
IF (&ZCMD = 'N2')
  &ZCMD = 2
IF (&ZCMD = 'N3')
  &ZCMD = 3
IF (&ZCMD = 'N4')
  &ZCMD = 4
IF (&ZCMD = 'N5')
  &ZCMD = 5
IF (&ZCMD = 'N6')
  &ZCMD = 6
IF (&ZCMD = 'N7')
  &ZCMD = 7
IF (&ZCMD = 'N8')
  &ZCMD = 8
IF (&ZCMD = 'N9')
  &ZCMD = 9
IF (&ZCMD = 'VOLUME')
  IF (&ZPSLVX1 = '')
    &ZCMD = 'SORT VOLUME ASCENDING'
    &ZPSLVX1 = ''     /*      VOLUME        */
    &ZPSLVX2 = ''     /*      ADDRESS       */
    &ZPSLVX3 = ''     /*      DEVTYPE       */
    &ZPSLVX4 = ''     /*      COUNT         */
    &ZPSLVX5 = ''     /*      TOTAL         */
    &ZPSLVX6 = ''     /*      LARGEST       */
    &ZPSLVX7 = ''     /*      USED          */
    &ZPSLVX1 = 1
  ELSE
    &ZCMD = 'SORT VOLUME DESCENDING'
    &ZPSLVX1 = ''
IF (&ZCMD = 'ADDRESS')
  IF (&ZPSLVX2 = '')
    &ZCMD = 'SORT ADDRESS ASCENDING'
    &ZPSLVX1 = ''     /*      VOLUME        */
    &ZPSLVX2 = ''     /*      ADDRESS       */
    &ZPSLVX3 = ''     /*      DEVTYPE       */
    &ZPSLVX4 = ''     /*      COUNT         */
    &ZPSLVX5 = ''     /*      TOTAL         */
    &ZPSLVX6 = ''     /*      LARGEST       */
    &ZPSLVX7 = ''     /*      USED          */
    &ZPSLVX2 = 1
  ELSE
    &ZCMD = 'SORT ADDRESS DESCENDING'
    &ZPSLVX2 = ''
IF (&ZCMD = 'TYPE')
  IF (&ZPSLVX3 = '')
    &ZCMD = 'SORT TYPE ASCENDING'
    &ZPSLVX1 = ''     /*      VOLUME        */
    &ZPSLVX2 = ''     /*      ADDRESS       */
    &ZPSLVX3 = ''     /*      DEVTYPE       */
    &ZPSLVX4 = ''     /*      COUNT         */
    &ZPSLVX5 = ''     /*      TOTAL         */
    &ZPSLVX6 = ''     /*      LARGEST       */
    &ZPSLVX7 = ''     /*      USED          */
    &ZPSLVX3 = 1
  ELSE
    &ZCMD = 'SORT TYPE DESCENDING'
    &ZPSLVX3 = ''
IF (&ZCMD = 'COUNT')
  IF (&ZPSLVX4 = '')
    &ZCMD = 'SORT COUNT ASCENDING'
    &ZPSLVX1 = ''     /*      VOLUME        */
    &ZPSLVX2 = ''     /*      ADDRESS       */
    &ZPSLVX3 = ''     /*      DEVTYPE       */
    &ZPSLVX4 = ''     /*      COUNT         */
    &ZPSLVX5 = ''     /*      TOTAL         */
    &ZPSLVX6 = ''     /*      LARGEST       */
    &ZPSLVX7 = ''     /*      USED          */
    &ZPSLVX4 = 1
  ELSE
    &ZCMD = 'SORT COUNT DESCENDING'
    &ZPSLVX4 = ''
IF (&ZCMD = 'TOTAL')
  IF (&ZPSLVX5 = '')
    &ZCMD = 'SORT TOTAL ASCENDING'
    &ZPSLVX1 = ''     /*      VOLUME        */
    &ZPSLVX2 = ''     /*      ADDRESS       */
    &ZPSLVX3 = ''     /*      DEVTYPE       */
    &ZPSLVX4 = ''     /*      COUNT         */
    &ZPSLVX5 = ''     /*      TOTAL         */
    &ZPSLVX6 = ''     /*      LARGEST       */
    &ZPSLVX7 = ''     /*      USED          */
    &ZPSLVX5 = 1
  ELSE
    &ZCMD = 'SORT TOTAL DESCENDING'
    &ZPSLVX5 = ''
IF (&ZCMD = 'LARGEST')
  IF (&ZPSLVX6 = '')
    &ZCMD = 'SORT LARGEST ASCENDING'
    &ZPSLVX1 = ''     /*      VOLUME        */
    &ZPSLVX2 = ''     /*      ADDRESS       */
    &ZPSLVX3 = ''     /*      DEVTYPE       */
    &ZPSLVX4 = ''     /*      COUNT         */
    &ZPSLVX5 = ''     /*      TOTAL         */
    &ZPSLVX6 = ''     /*      LARGEST       */
    &ZPSLVX7 = ''     /*      USED          */
    &ZPSLVX6 = 1
  ELSE
    &ZCMD = 'SORT LARGEST DESCENDING'
    &ZPSLVX6 = ''
)PNTS
FIELD(volume ) VAR(ZCMD) VAL('SORT VOLUME')
FIELD(dev1   ) VAR(ZCMD) VAL('SORT ADDRESS')
FIELD(dev2   ) VAR(ZCMD) VAL('SORT TYPE')
FIELD(use    ) VAR(ZCMD) VAL('SORT COUNT')
FIELD(tfree  ) VAR(ZCMD) VAL('SORT TOTAL')
FIELD(large  ) VAR(ZCMD) VAL('SORT LARGEST')
FIELD(name   ) VAR(ZCMD) VAL('SORT VOLUME')
FIELD(addr   ) VAR(ZCMD) VAL('SORT ADDRESS')
FIELD(type   ) VAR(ZCMD) VAL('SORT TYPE')
FIELD(cnt    ) VAR(ZCMD) VAL('SORT COUNT')
FIELD(cyltrke) VAR(ZCMD) VAL('SORT TOTAL')
FIELD(cyltrk ) VAR(ZCMD) VAL('SORT LARGEST')
)END
./ ADD NAME=P86PNIPS 0119-98141-16221-1017-00253-00024-00000-T311LBD 51
)ATTR DEFAULT(%+_)
    # TYPE(AB)    FORMAT(MIX)
    " TYPE(ABSL) GE(ON)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    ¬ TYPE(OUTPUT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
    @ TYPE(OUTPUT) INTENS(LOW)
    } TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW) SKIP(ON) HILITE(USCORE)
    $ type(output) intens(high) caps(off) just(asis) pas(on) hilite(uscore)
)ABC DESC('Memlist') MNEM(1)
PDC DESC('All Members') MNEM(13)
 ACTION RUN(MLALL)
PDC DESC('Members Updated Today') MNEM(13)
 ACTION RUN(MLTO)
PDC DESC('Members Updated Yesterday') MNEM(13)
 ACTION RUN(MLYES)
PDC DESC('Members Updated Last 7 days') MNEM(13)
 ACTION RUN(MLWE)
PDC DESC('Members Updated Last 30 days') MNEM(13)
 ACTION RUN(MLMON)
PDC DESC('Members Updated Last 90 days') MNEM(13)
 ACTION RUN(MLQTR)
PDC DESC('Members Updated Last 365 days') MNEM(13)
 ACTION RUN(MLYR)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Functions') MNEM(1)
PDC DESC('List Allocations') MNEM(6)
 ACTION RUN(LA)
PDC DESC('List Files...') MNEM(6)
 ACTION RUN(LF)
PDC DESC('Active Catalog List') MNEM(3)
 ACTION RUN(CAX)
PDC DESC('Memlist...') MNEM(6)
 ACTION RUN(ML)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Function Menu...') MNEM(10)
 ACTION RUN(FN)
PDC DESC('Function Status') MNEM(10)
 ACTION RUN(FU)
PDC DESC('PDS TSO Command Table') MNEM(7)
 ACTION RUN(TCT)
PDC DESC('End PDS Session') MNEM(3)
 ACTION RUN(QUIT)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Options') MNEM(1)
PDC DESC('Subcommand Selection...') MNEM(3)
 ACTION RUN(O)
PDC DESC('Change Datasets') MNEM(1)
 ACTION RUN(CHANGE)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Special') MNEM(1)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N1)
PDC DESC('Clear Table') MNEM(5)
 ACTION RUN(N2)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N3)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N4)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N5)
PDC DESC('MEMLIST All') MNEM(9)
 ACTION RUN(N6)
PDC DESC('Output Table...') MNEM(3)
 ACTION RUN(N7)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Swap Panels') MNEM(6)
 ACTION RUN(N9)
PDC DESC('Sort Table...') MNEM(4)
 ACTION RUN(SORTPDC)
PDC DESC('Find in Table...') MNEM(4)
 ACTION RUN(FINDPDC)
PDC DESC('Exclude All') MNEM(10)
 ACTION RUN(EXCLALL)
PDC DESC('Exclude Above') MNEM(10)
 ACTION RUN(EXCLUP)
PDC DESC('Exclude Below') MNEM(10)
 ACTION RUN(EXCLDN)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Defaults') MNEM(1)
PDC DESC('Set Environmental Options') MNEM(6)
 ACTION RUN(SETENV)
PDC DESC('Set Select Alias Commands') MNEM(6)
 ACTION RUN(SETSEL)
PDC DESC('Set Log Limit Values') MNEM(6)
 ACTION RUN(SETLOG)
PDC DESC('Set Member List Options') MNEM(6)
 ACTION RUN(SETML)
PDC DESC('Set LISTV Options') MNEM(6)
 ACTION RUN(SETV)
PDC DESC('Set LISTC Options') MNEM(6)
 ACTION RUN(SETLF)
PDC DESC('Set TRAP Options') MNEM(6)
 ACTION RUN(SETTRAP)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Help') MNEM(1)
PDC PDCTEXT('List Volumes Display')
 ACTION RUN(HELP)
PDC PDCTEXT('PDS Full-screen Help')
 ACTION RUN(TSO) PARM('HEL PDS86')
PDC PDCTEXT('PDS Tutorial Directory')
 ACTION RUN(TUTOR) PARM('P86PN@PO')
PDC PDCTEXT('Undocumented Items')
 ACTION RUN(TUTOR) PARM('P86UNDOC')
PDC PDCTEXT('About PDS...')
 ACTION RUN(TUTOR) PARM('P86LOGO')
PDC PDCTEXT('PDS Birthday')
 ACTION RUN(TUTOR) PARM('P86BIRTH')
)ABCINIT
.ZVARS=ZCMD
)BODY EXPAND(\\)
%# Memlist# Functions# Options# Special# Defaults# Help+
"-------------------------------------------------------------------------------
+\ \¢List Volumes+\ \
%Command ===>¦ZCMD                                            %Scroll ===>_Z   +
Enter an ISPF command or a special control code:
+  -----------------------------------------------------------------------------
}CMD $volume}  DATA  $deva$devt  +------MOUNT-------$use+-----VTOC---- FREE
+----$name  +--------$addr$type  +ATTR STAT --INDC--$cnt+--CCHH-- SIZE DSCB
)MODEL
_Z   ¬Z     _Z       @Z   @Z     @Z   @Z   @Z       @Z  @Z       @Z   @Z   +
)INIT
   &OPT3 = 1
   .HELP  = P86PNI@
   .ZVARS = '(ZSCBR PDSVOPT  PDSVVOL  PDSVDATA PDSVADDR PDSVTYPE +
            PDSVATTR PDSVSTAT PDSVINDC PDSVCNT PDSVVTOC PDSVVSIZ PDSVDSCB)'
 &volume  = 'VOLUME'
 &deva    = 'DEV'
 &devt    = 'TYPE'
 &use     = 'USE'
 &name    = ' NAME'
 &addr    = 'ADDR'
 &type    = 'TYPE'
 &cnt     = 'CNT'
)PROC
IF (&ZCMD = 'MLALL')
  &ZCMD = 'MEMLIST :'
IF (&ZCMD = 'MLTO')
  &ZCMD = 'MEMLIST : TODAY'
IF (&ZCMD = 'MLYES')
  &ZCMD = 'MEMLIST : YESTERDAY'
IF (&ZCMD = 'MLWE')
  &ZCMD = 'MEMLIST : WEEK'
IF (&ZCMD = 'MLMON')
  &ZCMD = 'MEMLIST : MONTH'
IF (&ZCMD = 'MLQTR')
  &ZCMD = 'MEMLIST : QUARTER'
IF (&ZCMD = 'MLYR')
  &ZCMD = 'MEMLIST : YEAR'
IF (&ZCMD = 'SORTPDC')
  &ZCMD = 'SORT ?'
IF (&ZCMD = 'FINDPDC')
  &ZCMD = 'F ?'
IF (&ZCMD = 'EXCLALL')
  &ZCMD = 'X ALL'
IF (&ZCMD = 'EXCLUP')
  &ZCMD = 'X UP'
IF (&ZCMD = 'EXCLDN')
  &ZCMD = 'X DN'
IF (&ZCMD = 'N1')
  &ZCMD = 1
IF (&ZCMD = 'N2')
  &ZCMD = 2
IF (&ZCMD = 'N3')
  &ZCMD = 3
IF (&ZCMD = 'N4')
  &ZCMD = 4
IF (&ZCMD = 'N5')
  &ZCMD = 5
IF (&ZCMD = 'N6')
  &ZCMD = 6
IF (&ZCMD = 'N7')
  &ZCMD = 7
IF (&ZCMD = 'N8')
  &ZCMD = 8
IF (&ZCMD = 'N9')
  &ZCMD = 9
IF (&ZCMD = 'VOLUME')
  IF (&ZPSLVX1 = '')
    &ZCMD = 'SORT VOLUME ASCENDING'
    &ZPSLVX1 = ''     /*      VOLUME        */
    &ZPSLVX2 = ''     /*      ADDRESS       */
    &ZPSLVX3 = ''     /*      DEVTYPE       */
    &ZPSLVX4 = ''     /*      COUNT         */
    &ZPSLVX5 = ''     /*      TOTAL         */
    &ZPSLVX6 = ''     /*      LARGEST       */
    &ZPSLVX7 = ''     /*      USED          */
    &ZPSLVX1 = 1
  ELSE
    &ZCMD = 'SORT VOLUME DESCENDING'
    &ZPSLVX1 = ''
IF (&ZCMD = 'ADDRESS')
  IF (&ZPSLVX2 = '')
    &ZCMD = 'SORT ADDRESS ASCENDING'
    &ZPSLVX1 = ''     /*      VOLUME        */
    &ZPSLVX2 = ''     /*      ADDRESS       */
    &ZPSLVX3 = ''     /*      DEVTYPE       */
    &ZPSLVX4 = ''     /*      COUNT         */
    &ZPSLVX5 = ''     /*      TOTAL         */
    &ZPSLVX6 = ''     /*      LARGEST       */
    &ZPSLVX7 = ''     /*      USED          */
    &ZPSLVX2 = 1
  ELSE
    &ZCMD = 'SORT ADDRESS DESCENDING'
    &ZPSLVX2 = ''
IF (&ZCMD = 'TYPE')
  IF (&ZPSLVX3 = '')
    &ZCMD = 'SORT TYPE ASCENDING'
    &ZPSLVX1 = ''     /*      VOLUME        */
    &ZPSLVX2 = ''     /*      ADDRESS       */
    &ZPSLVX3 = ''     /*      DEVTYPE       */
    &ZPSLVX4 = ''     /*      COUNT         */
    &ZPSLVX5 = ''     /*      TOTAL         */
    &ZPSLVX6 = ''     /*      LARGEST       */
    &ZPSLVX7 = ''     /*      USED          */
    &ZPSLVX3 = 1
  ELSE
    &ZCMD = 'SORT TYPE DESCENDING'
    &ZPSLVX3 = ''
IF (&ZCMD = 'COUNT')
  IF (&ZPSLVX4 = '')
    &ZCMD = 'SORT COUNT ASCENDING'
    &ZPSLVX1 = ''     /*      VOLUME        */
    &ZPSLVX2 = ''     /*      ADDRESS       */
    &ZPSLVX3 = ''     /*      DEVTYPE       */
    &ZPSLVX4 = ''     /*      COUNT         */
    &ZPSLVX5 = ''     /*      TOTAL         */
    &ZPSLVX6 = ''     /*      LARGEST       */
    &ZPSLVX7 = ''     /*      USED          */
    &ZPSLVX4 = 1
  ELSE
    &ZCMD = 'SORT COUNT DESCENDING'
    &ZPSLVX4 = ''
)PNTS
FIELD(volume  ) VAR(ZCMD) VAL('SORT VOLUME')
FIELD(deva    ) VAR(ZCMD) VAL('SORT ADDRESS')
FIELD(devt    ) VAR(ZCMD) VAL('SORT TYPE')
FIELD(use     ) VAR(ZCMD) VAL('SORT COUNT')
FIELD(name    ) VAR(ZCMD) VAL('SORT VOLUME')
FIELD(addr    ) VAR(ZCMD) VAL('SORT ADDRESS')
FIELD(type    ) VAR(ZCMD) VAL('SORT TYPE')
FIELD(cnt     ) VAR(ZCMD) VAL('SORT COUNT')
)END
./ ADD NAME=P86PNKPS 0131-98284-16221-1020-00209-00051-00000-T311LBD 11
)ATTR DEFAULT(%+_)
    # TYPE(AB)    FORMAT(MIX)
    " TYPE(ABSL) GE(ON)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    ¬ TYPE(OUTPUT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
    @ TYPE(OUTPUT) INTENS(LOW) SKIP(ON)
    } TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW) SKIP(ON) HILITE(USCORE)
    $ type(output) intens(high) caps(off) just(asis) pas(on) hilite(uscore)
)ABC DESC('Memlist') MNEM(1)
PDC DESC('All Members') MNEM(13)
 ACTION RUN(MLALL)
PDC DESC('Members Updated Today') MNEM(13)
 ACTION RUN(MLTO)
PDC DESC('Members Updated Yesterday') MNEM(13)
 ACTION RUN(MLYES)
PDC DESC('Members Updated Last 7 days') MNEM(13)
 ACTION RUN(MLWE)
PDC DESC('Members Updated Last 30 days') MNEM(13)
 ACTION RUN(MLMON)
PDC DESC('Members Updated Last 90 days') MNEM(13)
 ACTION RUN(MLQTR)
PDC DESC('Members Updated Last 365 days') MNEM(13)
 ACTION RUN(MLYR)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Functions') MNEM(1)
PDC DESC('List Allocations') MNEM(6)
 ACTION RUN(LA)
PDC DESC('List Volumes...') MNEM(6)
 ACTION RUN(LV)
PDC DESC('Active Catalog List') MNEM(3)
 ACTION RUN(CAX)
PDC DESC('Memlist') MNEM(6)
 ACTION RUN(ML)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Function Menu...') MNEM(10)
 ACTION RUN(FN)
PDC DESC('Function Status') MNEM(10)
 ACTION RUN(FU)
PDC DESC('PDS TSO Command Table') MNEM(7)
 ACTION RUN(TCT)
PDC DESC('End PDS Session') MNEM(3)
 ACTION RUN(QUIT)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Options') MNEM(1)
PDC DESC('Subcommand Selection...') MNEM(3)
 ACTION RUN(O)
PDC DESC('Change Datasets') MNEM(1)
 ACTION RUN(CHANGE)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Special') MNEM(1)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N1)
PDC DESC('Clear Table') MNEM(5)
 ACTION RUN(N2)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N3)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N4)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N5)
PDC DESC('MEMLIST All') MNEM(9)
 ACTION RUN(N6)
PDC DESC('Output Table...') MNEM(3)
 ACTION RUN(N7)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Swap Panels') MNEM(6)
 ACTION RUN(N9)
PDC DESC('Sort Table...') MNEM(4)
 ACTION RUN(SORTPDC)
PDC DESC('Find in Table...') MNEM(4)
 ACTION RUN(FINDPDC)
PDC DESC('Exclude All') MNEM(10)
 ACTION RUN(EXCLALL)
PDC DESC('Exclude Above') MNEM(10)
 ACTION RUN(EXCLUP)
PDC DESC('Exclude Below') MNEM(10)
 ACTION RUN(EXCLDN)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Defaults') MNEM(1)
PDC DESC('Set Environmental Options') MNEM(6)
 ACTION RUN(SETENV)
PDC DESC('Set Select Alias Commands') MNEM(6)
 ACTION RUN(SETSEL)
PDC DESC('Set Log Limit Values') MNEM(6)
 ACTION RUN(SETLOG)
PDC DESC('Set Member List Options') MNEM(6)
 ACTION RUN(SETML)
PDC DESC('Set LISTV Options') MNEM(6)
 ACTION RUN(SETV)
PDC DESC('Set LISTC Options') MNEM(6)
 ACTION RUN(SETLF)
PDC DESC('Set TRAP Options') MNEM(6)
 ACTION RUN(SETTRAP)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Help') MNEM(1)
PDC PDCTEXT('List Files from Catalog or VTOC')
 ACTION RUN(HELP)
PDC PDCTEXT('PDS Full-screen Help')
 ACTION RUN(TSO) PARM('HEL PDS86')
PDC PDCTEXT('PDS Tutorial Directory')
 ACTION RUN(TUTOR) PARM('P86PN@PO')
PDC PDCTEXT('Undocumented Items')
 ACTION RUN(TUTOR) PARM('P86UNDOC')
PDC PDCTEXT('About PDS...')
 ACTION RUN(TUTOR) PARM('P86LOGO')
PDC PDCTEXT('PDS Birthday')
 ACTION RUN(TUTOR) PARM('P86BIRTH')
)ABCINIT
.ZVARS=ZCMD
)BODY EXPAND(\\)
%# Memlist# Functions# Options# Special# Defaults# Help+
"-------------------------------------------------------------------------------
+\ \¢List Files+\ \
%Command ===>¦ZCMD                                            %Scroll ===>_Z   +
Enter an ISPF command or a special control code:
+  -----------------------------------------------------------------------------
}CMD +C V DATA/MSG DO  RECF LRECL BLKSI$volume$data
)MODEL
_Z   @Z@Z_Z       @Z  @Z   @Z    @Z    @Z     @Z
)INIT
   &OPT3 = 1
   .HELP  = P86PNK@
   .ZVARS = '(ZSCBR PDSCOPT PDSCCAT PDSCVTOC PDSCDATA PDSCDSOR +
            PDSCRF PDSCLREC PDSCBLKS PDSCVOL PDSCDSN)'
   VPUT (PDSTNAME) SHARED
 &volume = 'VOLUME'
 &data   = '---------DATA SET NAME ----------'
)PROC
IF (&ZCMD = 'MLALL')
  &ZCMD = 'MEMLIST :'
IF (&ZCMD = 'MLTO')
  &ZCMD = 'MEMLIST : TODAY'
IF (&ZCMD = 'MLYES')
  &ZCMD = 'MEMLIST : YESTERDAY'
IF (&ZCMD = 'MLWE')
  &ZCMD = 'MEMLIST : WEEK'
IF (&ZCMD = 'MLMON')
  &ZCMD = 'MEMLIST : MONTH'
IF (&ZCMD = 'MLQTR')
  &ZCMD = 'MEMLIST : QUARTER'
IF (&ZCMD = 'MLYR')
  &ZCMD = 'MEMLIST : YEAR'
IF (&ZCMD = 'SORTPDC')
  &ZCMD = 'SORT ?'
IF (&ZCMD = 'FINDPDC')
  &ZCMD = 'F ?'
IF (&ZCMD = 'EXCLALL')
  &ZCMD = 'X ALL'
IF (&ZCMD = 'EXCLUP')
  &ZCMD = 'X UP'
IF (&ZCMD = 'EXCLDN')
  &ZCMD = 'X DN'
IF (&ZCMD = 'N1')
  &ZCMD = 1
IF (&ZCMD = 'N2')
  &ZCMD = 2
IF (&ZCMD = 'N3')
  &ZCMD = 3
IF (&ZCMD = 'N4')
  &ZCMD = 4
IF (&ZCMD = 'N5')
  &ZCMD = 5
IF (&ZCMD = 'N6')
  &ZCMD = 6
IF (&ZCMD = 'N7')
  &ZCMD = 7
IF (&ZCMD = 'N8')
  &ZCMD = 8
IF (&ZCMD = 'N9')
  &ZCMD = 9
IF (&ZCMD = 'VOLUME')
  IF (&ZPSLFX1 = '')
    &ZCMD = 'SORT VOLUME ASCENDING'
    &ZPSLFX1 = ''     /*      VOLUME        */
    &ZPSLFX2 = ''     /*      DSNAME        */
    &ZPSLFX3 = ''     /*      CDATE         */
    &ZPSLFX4 = ''     /*      SIZE          */
    &ZPSLFX5 = ''     /*      RDATE         */
    &ZPSLFX1 = 1
  ELSE
    &ZCMD = 'SORT VOLUME DESCENDING'
    &ZPSLFX1 = ''
IF (&ZCMD = 'DSNAME')
  IF (&ZPSLFX2 = '')
    &ZCMD = 'SORT DSNAME ASCENDING'
    &ZPSLFX1 = ''     /*      VOLUME        */
    &ZPSLFX2 = ''     /*      DSNAME        */
    &ZPSLFX3 = ''     /*      CDATE         */
    &ZPSLFX4 = ''     /*      SIZE          */
    &ZPSLFX5 = ''     /*      RDATE         */
    &ZPSLFX2 = 1
  ELSE
    &ZCMD = 'SORT DSNAME DESCENDING'
    &ZPSLFX2 = ''
)PNTS
FIELD(volume) VAR(ZCMD) VAL('SORT VOLUME')
FIELD(data)   VAR(ZCMD) VAL('SORT DSNAME')
)END
./ ADD NAME=P86PNLPS 0118-98284-16221-1023-00208-00033-00000-T311LBD 00
)ATTR DEFAULT(%+_)
    # TYPE(AB)    FORMAT(MIX)
    " TYPE(ABSL) GE(ON)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    ¬ TYPE(OUTPUT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
    @ TYPE(OUTPUT) INTENS(LOW) SKIP(ON)
    } TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW) SKIP(ON) HILITE(USCORE)
    $ type(output) intens(high) caps(off) just(asis) pas(on) hilite(uscore)
)ABC DESC('Memlist') MNEM(1)
PDC DESC('All Members') MNEM(13)
 ACTION RUN(MLALL)
PDC DESC('Members Updated Today') MNEM(13)
 ACTION RUN(MLTO)
PDC DESC('Members Updated Yesterday') MNEM(13)
 ACTION RUN(MLYES)
PDC DESC('Members Updated Last 7 days') MNEM(13)
 ACTION RUN(MLWE)
PDC DESC('Members Updated Last 30 days') MNEM(13)
 ACTION RUN(MLMON)
PDC DESC('Members Updated Last 90 days') MNEM(13)
 ACTION RUN(MLQTR)
PDC DESC('Members Updated Last 365 days') MNEM(13)
 ACTION RUN(MLYR)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Functions') MNEM(1)
PDC DESC('List Allocations') MNEM(6)
 ACTION RUN(LA)
PDC DESC('List Volumes...') MNEM(6)
 ACTION RUN(LV)
PDC DESC('Active Catalog List') MNEM(3)
 ACTION RUN(CAX)
PDC DESC('Memlist') MNEM(6)
 ACTION RUN(ML)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Function Menu...') MNEM(10)
 ACTION RUN(FN)
PDC DESC('Function Status') MNEM(10)
 ACTION RUN(FU)
PDC DESC('PDS TSO Command Table') MNEM(7)
 ACTION RUN(TCT)
PDC DESC('End PDS Session') MNEM(3)
 ACTION RUN(QUIT)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Options') MNEM(1)
PDC DESC('Subcommand Selection...') MNEM(3)
 ACTION RUN(O)
PDC DESC('Change Datasets') MNEM(1)
 ACTION RUN(CHANGE)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Special') MNEM(1)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N1)
PDC DESC('Clear Table') MNEM(5)
 ACTION RUN(N2)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N3)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N4)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N5)
PDC DESC('MEMLIST All') MNEM(9)
 ACTION RUN(N6)
PDC DESC('Output Table...') MNEM(3)
 ACTION RUN(N7)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Swap Panels') MNEM(6)
 ACTION RUN(N9)
PDC DESC('Sort Table...') MNEM(4)
 ACTION RUN(SORTPDC)
PDC DESC('Find in Table...') MNEM(4)
 ACTION RUN(FINDPDC)
PDC DESC('Exclude All') MNEM(10)
 ACTION RUN(EXCLALL)
PDC DESC('Exclude Above') MNEM(10)
 ACTION RUN(EXCLUP)
PDC DESC('Exclude Below') MNEM(10)
 ACTION RUN(EXCLDN)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Defaults') MNEM(1)
PDC DESC('Set Environmental Options') MNEM(6)
 ACTION RUN(SETENV)
PDC DESC('Set Select Alias Commands') MNEM(6)
 ACTION RUN(SETSEL)
PDC DESC('Set Log Limit Values') MNEM(6)
 ACTION RUN(SETLOG)
PDC DESC('Set Member List Options') MNEM(6)
 ACTION RUN(SETML)
PDC DESC('Set LISTV Options') MNEM(6)
 ACTION RUN(SETV)
PDC DESC('Set LISTC Options') MNEM(6)
 ACTION RUN(SETLF)
PDC DESC('Set TRAP Options') MNEM(6)
 ACTION RUN(SETTRAP)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Help') MNEM(1)
PDC PDCTEXT('List Files from Catalog or VTOC')
 ACTION RUN(HELP)
PDC PDCTEXT('PDS Full-screen Help')
 ACTION RUN(TSO) PARM('HEL PDS86')
PDC PDCTEXT('PDS Tutorial Directory')
 ACTION RUN(TUTOR) PARM('P86PN@PO')
PDC PDCTEXT('Undocumented Items')
 ACTION RUN(TUTOR) PARM('P86UNDOC')
PDC PDCTEXT('About PDS...')
 ACTION RUN(TUTOR) PARM('P86LOGO')
PDC PDCTEXT('PDS Birthday')
 ACTION RUN(TUTOR) PARM('P86BIRTH')
)ABCINIT
.ZVARS=ZCMD
)BODY EXPAND(\\)
%# Memlist# Functions# Options# Special# Defaults# Help+
"-------------------------------------------------------------------------------
+\ \¢List Files+\ \
%Command ===>¦ZCMD                                            %Scroll ===>_Z   +
Enter an ISPF command or a special control code:
+  -----------------------------------------------------------------------------
}CMD +C V DATA/MSG DO  RECF$volume$data
)MODEL
_Z   @Z@Z_Z       @Z  @Z   @Z     @Z                                           +
)INIT
   &OPT3 = 1
   .HELP  = P86PNK@
   .ZVARS = '(ZSCBR PDSCOPT PDSCCAT PDSCVTOC PDSCDATA PDSCDSOR PDSCRF +
            PDSCVOL PDSCDSN)'
 &volume = 'VOLUME'
 &data   = '---------DATA SET NAME ----------------------'
)PROC
IF (&ZCMD = 'MLALL')
  &ZCMD = 'MEMLIST :'
IF (&ZCMD = 'MLTO')
  &ZCMD = 'MEMLIST : TODAY'
IF (&ZCMD = 'MLYES')
  &ZCMD = 'MEMLIST : YESTERDAY'
IF (&ZCMD = 'MLWE')
  &ZCMD = 'MEMLIST : WEEK'
IF (&ZCMD = 'MLMON')
  &ZCMD = 'MEMLIST : MONTH'
IF (&ZCMD = 'MLQTR')
  &ZCMD = 'MEMLIST : QUARTER'
IF (&ZCMD = 'MLYR')
  &ZCMD = 'MEMLIST : YEAR'
IF (&ZCMD = 'SORTPDC')
  &ZCMD = 'SORT ?'
IF (&ZCMD = 'FINDPDC')
  &ZCMD = 'F ?'
IF (&ZCMD = 'EXCLALL')
  &ZCMD = 'X ALL'
IF (&ZCMD = 'EXCLUP')
  &ZCMD = 'X UP'
IF (&ZCMD = 'EXCLDN')
  &ZCMD = 'X DN'
IF (&ZCMD = 'N1')
  &ZCMD = 1
IF (&ZCMD = 'N2')
  &ZCMD = 2
IF (&ZCMD = 'N3')
  &ZCMD = 3
IF (&ZCMD = 'N4')
  &ZCMD = 4
IF (&ZCMD = 'N5')
  &ZCMD = 5
IF (&ZCMD = 'N6')
  &ZCMD = 6
IF (&ZCMD = 'N7')
  &ZCMD = 7
IF (&ZCMD = 'N8')
  &ZCMD = 8
IF (&ZCMD = 'N9')
  &ZCMD = 9
IF (&ZCMD = 'VOLUME')
  IF (&ZPSLFX1 = '')
    &ZCMD = 'SORT VOLUME ASCENDING'
    &ZPSLFX1 = ''     /*      VOLUME        */
    &ZPSLFX2 = ''     /*      DSNAME        */
    &ZPSLFX3 = ''     /*      CDATE         */
    &ZPSLFX4 = ''     /*      SIZE          */
    &ZPSLFX5 = ''     /*      RDATE         */
    &ZPSLFX1 = 1
  ELSE
    &ZCMD = 'SORT VOLUME DESCENDING'
    &ZPSLFX1 = ''
IF (&ZCMD = 'DSNAME')
  IF (&ZPSLFX2 = '')
    &ZCMD = 'SORT DSNAME ASCENDING'
    &ZPSLFX1 = ''     /*      VOLUME        */
    &ZPSLFX2 = ''     /*      DSNAME        */
    &ZPSLFX3 = ''     /*      CDATE         */
    &ZPSLFX4 = ''     /*      SIZE          */
    &ZPSLFX5 = ''     /*      RDATE         */
    &ZPSLFX2 = 1
  ELSE
    &ZCMD = 'SORT DSNAME DESCENDING'
    &ZPSLFX2 = ''
)PNTS
FIELD(volume) VAR(ZCMD) VAL('SORT VOLUME')
FIELD(data)   VAR(ZCMD) VAL('SORT DSNAME')
)END
./ ADD NAME=P86PNMPS 0144-98284-16221-1029-00273-00049-00000-T311LBD 57
)ATTR DEFAULT(%+_)
    # TYPE(AB)    FORMAT(MIX)
    " TYPE(ABSL) GE(ON)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    ¬ TYPE(OUTPUT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
    @ TYPE(OUTPUT) INTENS(LOW) SKIP(ON)
    ~ TYPE(OUTPUT) INTENS(LOW) SKIP(ON) JUST(RIGHT)
    } TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW) SKIP(ON) HILITE(USCORE)
    $ type(output) intens(high) caps(off) just(asis) pas(on) hilite(uscore)
)ABC DESC('Memlist') MNEM(1)
PDC DESC('All Members') MNEM(13)
 ACTION RUN(MLALL)
PDC DESC('Members Updated Today') MNEM(13)
 ACTION RUN(MLTO)
PDC DESC('Members Updated Yesterday') MNEM(13)
 ACTION RUN(MLYES)
PDC DESC('Members Updated Last 7 days') MNEM(13)
 ACTION RUN(MLWE)
PDC DESC('Members Updated Last 30 days') MNEM(13)
 ACTION RUN(MLMON)
PDC DESC('Members Updated Last 90 days') MNEM(13)
 ACTION RUN(MLQTR)
PDC DESC('Members Updated Last 365 days') MNEM(13)
 ACTION RUN(MLYR)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Functions') MNEM(1)
PDC DESC('List Allocations') MNEM(6)
 ACTION RUN(LA)
PDC DESC('List Volumes...') MNEM(6)
 ACTION RUN(LV)
PDC DESC('Active Catalog List') MNEM(3)
 ACTION RUN(CAX)
PDC DESC('Memlist') MNEM(6)
 ACTION RUN(ML)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Function Menu...') MNEM(10)
 ACTION RUN(FN)
PDC DESC('Function Status') MNEM(10)
 ACTION RUN(FU)
PDC DESC('PDS TSO Command Table') MNEM(7)
 ACTION RUN(TCT)
PDC DESC('End PDS Session') MNEM(3)
 ACTION RUN(QUIT)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Options') MNEM(1)
PDC DESC('Subcommand Selection...') MNEM(3)
 ACTION RUN(O)
PDC DESC('Change Datasets') MNEM(1)
 ACTION RUN(CHANGE)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Special') MNEM(1)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N1)
PDC DESC('Clear Table') MNEM(5)
 ACTION RUN(N2)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N3)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N4)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N5)
PDC DESC('MEMLIST All') MNEM(9)
 ACTION RUN(N6)
PDC DESC('Output Table...') MNEM(3)
 ACTION RUN(N7)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Swap Panels') MNEM(6)
 ACTION RUN(N9)
PDC DESC('Sort Table...') MNEM(4)
 ACTION RUN(SORTPDC)
PDC DESC('Find in Table...') MNEM(4)
 ACTION RUN(FINDPDC)
PDC DESC('Exclude All') MNEM(10)
 ACTION RUN(EXCLALL)
PDC DESC('Exclude Above') MNEM(10)
 ACTION RUN(EXCLUP)
PDC DESC('Exclude Below') MNEM(10)
 ACTION RUN(EXCLDN)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Defaults') MNEM(1)
PDC DESC('Set Environmental Options') MNEM(6)
 ACTION RUN(SETENV)
PDC DESC('Set Select Alias Commands') MNEM(6)
 ACTION RUN(SETSEL)
PDC DESC('Set Log Limit Values') MNEM(6)
 ACTION RUN(SETLOG)
PDC DESC('Set Member List Options') MNEM(6)
 ACTION RUN(SETML)
PDC DESC('Set LISTV Options') MNEM(6)
 ACTION RUN(SETV)
PDC DESC('Set LISTC Options') MNEM(6)
 ACTION RUN(SETLF)
PDC DESC('Set TRAP Options') MNEM(6)
 ACTION RUN(SETTRAP)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Help') MNEM(1)
PDC PDCTEXT('List Files from Catalog or VTOC')
 ACTION RUN(HELP)
PDC PDCTEXT('PDS Full-screen Help')
 ACTION RUN(TSO) PARM('HEL PDS86')
PDC PDCTEXT('PDS Tutorial Directory')
 ACTION RUN(TUTOR) PARM('P86PN@PO')
PDC PDCTEXT('Undocumented Items')
 ACTION RUN(TUTOR) PARM('P86UNDOC')
PDC PDCTEXT('About PDS...')
 ACTION RUN(TUTOR) PARM('P86LOGO')
PDC PDCTEXT('PDS Birthday')
 ACTION RUN(TUTOR) PARM('P86BIRTH')
)ABCINIT
.ZVARS=ZCMD
)BODY EXPAND(\\)
%# Memlist# Functions# Options# Special# Defaults# Help+
"-------------------------------------------------------------------------------
+\ \¢List Files+\ \
%Command ===>¦ZCMD                                            %Scroll ===>_Z   +
Enter an ISPF command or a special control code:
+  -----------------------------------------------------------------------------
}CMD +C V DATA/MSG DO  RECF$volume$data
+                   LRECL      $creeated  $refer     $size     + USED
+                   BLKSI      +          +UPD EXT        FREE   SECONDARY
)MODEL
_Z   @Z@Z_Z       @Z  ~Z   @Z     @Z
+                  @Z     +    @Z         @Z         @Z       + @Z
+                  @Z     +    +          @Z  @Z     @Z       +     @Z
)INIT
   &OPT3 = 1
   .HELP  = P86PNK@
   .ZVARS = '(ZSCBR PDSCOPT  PDSCCAT  PDSCVTOC PDSCDATA PDSCDSOR PDSCRF +
                    PDSCVOL  PDSCDSN +
                    PDSCLREC PDSCCDAT PDSCRDAT PDSCTOT PDSCUSED +
                    PDSCBLKS PDSCUPD  PDSCEXT  PDSCFREE PDSCSEC)'
 &volume = 'VOLUME'
 &data   = '---------DATA SET NAME ----------------------'
 &created = 'CREATED'
 &refer   = 'REFERENCED'
 &size    = '    SIZE'
)PROC
IF (&ZCMD = 'MLALL')
  &ZCMD = 'MEMLIST :'
IF (&ZCMD = 'MLTO')
  &ZCMD = 'MEMLIST : TODAY'
IF (&ZCMD = 'MLYES')
  &ZCMD = 'MEMLIST : YESTERDAY'
IF (&ZCMD = 'MLWE')
  &ZCMD = 'MEMLIST : WEEK'
IF (&ZCMD = 'MLMON')
  &ZCMD = 'MEMLIST : MONTH'
IF (&ZCMD = 'MLQTR')
  &ZCMD = 'MEMLIST : QUARTER'
IF (&ZCMD = 'MLYR')
  &ZCMD = 'MEMLIST : YEAR'
IF (&ZCMD = 'SORTPDC')
  &ZCMD = 'SORT ?'
IF (&ZCMD = 'FINDPDC')
  &ZCMD = 'F ?'
IF (&ZCMD = 'EXCLALL')
  &ZCMD = 'X ALL'
IF (&ZCMD = 'EXCLUP')
  &ZCMD = 'X UP'
IF (&ZCMD = 'EXCLDN')
  &ZCMD = 'X DN'
IF (&ZCMD = 'N1')
  &ZCMD = 1
IF (&ZCMD = 'N2')
  &ZCMD = 2
IF (&ZCMD = 'N3')
  &ZCMD = 3
IF (&ZCMD = 'N4')
  &ZCMD = 4
IF (&ZCMD = 'N5')
  &ZCMD = 5
IF (&ZCMD = 'N6')
  &ZCMD = 6
IF (&ZCMD = 'N7')
  &ZCMD = 7
IF (&ZCMD = 'N8')
  &ZCMD = 8
IF (&ZCMD = 'N9')
  &ZCMD = 9
IF (&ZCMD = 'VOLUME')
  IF (&ZPSLFX1 = '')
    &ZCMD = 'SORT VOLUME ASCENDING'
    &ZPSLFX1 = ''     /*      VOLUME        */
    &ZPSLFX2 = ''     /*      DSNAME        */
    &ZPSLFX3 = ''     /*      CDATE         */
    &ZPSLFX4 = ''     /*      SIZE          */
    &ZPSLFX5 = ''     /*      RDATE         */
    &ZPSLFX1 = 1
  ELSE
    &ZCMD = 'SORT VOLUME DESCENDING'
    &ZPSLFX1 = ''
IF (&ZCMD = 'DSNAME')
  IF (&ZPSLFX2 = '')
    &ZCMD = 'SORT DSNAME ASCENDING'
    &ZPSLFX1 = ''     /*      VOLUME        */
    &ZPSLFX2 = ''     /*      DSNAME        */
    &ZPSLFX3 = ''     /*      CDATE         */
    &ZPSLFX4 = ''     /*      SIZE          */
    &ZPSLFX5 = ''     /*      RDATE         */
    &ZPSLFX2 = 1
  ELSE
    &ZCMD = 'SORT DSNAME DESCENDING'
    &ZPSLFX2 = ''
IF (&ZCMD = 'CDATE')
  IF (&ZPSLFX3 = '')
    &ZCMD = 'SORT CDATE DESCENDING'
    &ZPSLFX1 = ''     /*      VOLUME        */
    &ZPSLFX2 = ''     /*      DSNAME        */
    &ZPSLFX3 = ''     /*      CDATE         */
    &ZPSLFX4 = ''     /*      SIZE          */
    &ZPSLFX5 = ''     /*      RDATE         */
    &ZPSLFX3 = 1
  ELSE
    &ZCMD = 'SORT CDATE ASCENDING'
    &ZPSLFX3 = ''
IF (&ZCMD = 'RDATE')
  IF (&ZPSLFX4 = '')
    &ZCMD = 'SORT RDATE DESCENDING'
    &ZPSLFX1 = ''     /*      VOLUME        */
    &ZPSLFX2 = ''     /*      DSNAME        */
    &ZPSLFX3 = ''     /*      CDATE         */
    &ZPSLFX4 = ''     /*      SIZE          */
    &ZPSLFX5 = ''     /*      RDATE         */
    &ZPSLFX4 = 1
  ELSE
    &ZCMD = 'SORT RDATE ASCENDING'
    &ZPSLFX4 = ''
IF (&ZCMD = 'SIZE')
  IF (&ZPSLFX5 = '')
    &ZCMD = 'SORT SIZE DESCENDING'
    &ZPSLFX1 = ''     /*      VOLUME        */
    &ZPSLFX2 = ''     /*      DSNAME        */
    &ZPSLFX3 = ''     /*      CDATE         */
    &ZPSLFX4 = ''     /*      SIZE          */
    &ZPSLFX5 = ''     /*      RDATE         */
    &ZPSLFX5 = 1
  ELSE
    &ZCMD = 'SORT SIZE ASCENDING'
    &ZPSLFX5 = ''
)PNTS
FIELD(volume)  VAR(ZCMD) VAL('SORT VOLUME')
FIELD(data)    VAR(ZCMD) VAL('SORT DSNAME')
FIELD(created) VAR(ZCMD) VAL('SORT CDATE')
FIELD(refer)   VAR(ZCMD) VAL('SORT RDATE')
FIELD(size)    VAR(ZCMD) VAL('SORT SIZE')
)END
/* Old screen format - PNTS RDATE and SIZE changed position */
}CMD +C V DATA/MSG DO  RECF$VOLUME$---------DATA SET NAME ---------------------
+                   LRECL  KEY $CREATED +EXPIRATION$--SIZE- +-DIR-  ALLOC
+                    BLKSI  RKP $REFERENCED+UPD EXT  --FREE-  -MEM- -SEC-
)MODEL
_Z   @Z@Z_Z       @Z  @Z   @Z     @Z                                           +
+                  @Z     @Z   @Z       @Z         @Z       @Z      @Z
+                   @Z     @Z   @Z         @Z  @Z   @Z       @Z    @Z
)INIT
   &OPT3 = 1
   .HELP  = P86PNK@
   .ZVARS = '(ZSCBR PDSCOPT PDSCCAT PDSCVTOC PDSCDATA PDSCDSOR PDSCRF +
            PDSCVOL PDSCDSN +
            PDSCLREC PDSCKEYL PDSCCDAT PDSCEDAT PDSCTOT  PDSCDIR  PDSCATYP +
            PDSCBLKS PDSCRKP  PDSCRDAT PDSCUPD  PDSCEXT  PDSCFREE PDSCMMCT +
            PDSCSEC)'
./ ADD NAME=P86PNOPS 0124-98284-16224-0722-00216-00036-00000-T311LBD 48
)ATTR DEFAULT(!+_)
    # TYPE(AB)    FORMAT(MIX)
    " TYPE(ABSL) GE(ON)
    ! TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    ¬ TYPE(OUTPUT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
    @ TYPE(OUTPUT) INTENS(LOW) SKIP(ON)
    } TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW) SKIP(ON) HILITE(USCORE)
    $ type(output) intens(high) caps(off) just(asis) pas(on) hilite(uscore)
)ABC DESC('Memlist') MNEM(1)
PDC DESC('All Members') MNEM(13)
 ACTION RUN(MLALL)
PDC DESC('Members Updated Today') MNEM(13)
 ACTION RUN(MLTO)
PDC DESC('Members Updated Yesterday') MNEM(13)
 ACTION RUN(MLYES)
PDC DESC('Members Updated Last 7 days') MNEM(13)
 ACTION RUN(MLWE)
PDC DESC('Members Updated Last 30 days') MNEM(13)
 ACTION RUN(MLMON)
PDC DESC('Members Updated Last 90 days') MNEM(13)
 ACTION RUN(MLQTR)
PDC DESC('Members Updated Last 365 days') MNEM(13)
 ACTION RUN(MLYR)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Functions') MNEM(1)
PDC DESC('List Allocations') MNEM(6)
 ACTION RUN(LA)
PDC DESC('List Volumes...') MNEM(6)
 ACTION RUN(LV)
PDC DESC('List Files...') MNEM(6)
 ACTION RUN(LF)
PDC DESC('Memlist') MNEM(4)
 ACTION RUN(ML)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Function Menu...') MNEM(10)
 ACTION RUN(FN)
PDC DESC('Function Status') MNEM(10)
 ACTION RUN(FU)
PDC DESC('PDS TSO Command Table') MNEM(7)
 ACTION RUN(TCT)
PDC DESC('End PDS Session') MNEM(3)
 ACTION RUN(QUIT)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Options') MNEM(1)
PDC DESC('Subcommand Selection...') MNEM(3)
 ACTION RUN(O)
PDC DESC('Change Datasets') MNEM(1)
 ACTION RUN(CHANGE)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Special') MNEM(1)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N1)
PDC DESC('Clear Table') MNEM(5)
 ACTION RUN(N2)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N3)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N4)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N5)
PDC DESC('MEMLIST All') MNEM(9)
 ACTION RUN(N6)
PDC DESC('Output Table...') MNEM(3)
 ACTION RUN(N7)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N9)
PDC DESC('Sort Table...') MNEM(4)
 ACTION RUN(SORTPDC)
PDC DESC('Find in Table...') MNEM(4)
 ACTION RUN(FINDPDC)
PDC DESC('Exclude All') MNEM(10)
 ACTION RUN(EXCLALL)
PDC DESC('Exclude Above') MNEM(10)
 ACTION RUN(EXCLUP)
PDC DESC('Exclude Below') MNEM(10)
 ACTION RUN(EXCLDN)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Defaults') MNEM(1)
PDC DESC('Set Environmental Options') MNEM(6)
 ACTION RUN(SETENV)
PDC DESC('Set Select Alias Commands') MNEM(6)
 ACTION RUN(SETSEL)
PDC DESC('Set Log Limit Values') MNEM(6)
 ACTION RUN(SETLOG)
PDC DESC('Set Member List Options') MNEM(6)
 ACTION RUN(SETML)
PDC DESC('Set LISTV Options') MNEM(6)
 ACTION RUN(SETV)
PDC DESC('Set LISTC Options') MNEM(6)
 ACTION RUN(SETLF)
PDC DESC('Set TRAP Options') MNEM(6)
 ACTION RUN(SETTRAP)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Help') MNEM(1)
PDC PDCTEXT('Active Catalog Display')
 ACTION RUN(HELP)
PDC PDCTEXT('PDS Full-screen Help')
 ACTION RUN(TSO) PARM('HEL PDS86')
PDC PDCTEXT('PDS Tutorial Directory')
 ACTION RUN(TUTOR) PARM('P86PN@PO')
PDC PDCTEXT('Undocumented Items')
 ACTION RUN(TUTOR) PARM('P86UNDOC')
PDC PDCTEXT('About PDS...')
 ACTION RUN(TUTOR) PARM('P86LOGO')
PDC PDCTEXT('PDS Birthday')
 ACTION RUN(TUTOR) PARM('P86BIRTH')
)ABCINIT
.ZVARS=ZCMD
)BODY EXPAND(\\)
!# Memlist# Functions# Options# Special# Defaults# Help+
"-------------------------------------------------------------------------------
+\ \¢Active Catalog Display+\ \
!Command ===>¦ZCMD                                            !Scroll ===>_Z   +
Enter an ISPF command or a special control code:
+  -----------------------------------------------------------------------------
}CMD +DATA/MSG TYPE STATUS  HIT% $num$vol   $dsn                              +
)MODEL
_Z   _Z       @Z   @Z     @Z     @Z  @Z     @Z
)INIT
   &OPT3 = 1
   .HELP  = P86PNO@
   .ZVARS = '(ZSCBR PDSXOPT PDSXDATA PDSXTYPE +
             PDSXSTAT PDSXADDR PDSXNUM PDSXVOL PDSXDSN)'
 &num     = 'NUM'
 &vol     = 'VOLUMES'
 &dsn     = '---------DATA SET NAME ----------'
)PROC
IF (&ZCMD = 'MLALL')
  &ZCMD = 'MEMLIST :'
IF (&ZCMD = 'MLTO')
  &ZCMD = 'MEMLIST : TODAY'
IF (&ZCMD = 'MLYES')
  &ZCMD = 'MEMLIST : YESTERDAY'
IF (&ZCMD = 'MLWE')
  &ZCMD = 'MEMLIST : WEEK'
IF (&ZCMD = 'MLMON')
  &ZCMD = 'MEMLIST : MONTH'
IF (&ZCMD = 'MLQTR')
  &ZCMD = 'MEMLIST : QUARTER'
IF (&ZCMD = 'MLYR')
  &ZCMD = 'MEMLIST : YEAR'
IF (&ZCMD = 'SORTPDC')
  &ZCMD = 'SORT ?'
IF (&ZCMD = 'FINDPDC')
  &ZCMD = 'F ?'
IF (&ZCMD = 'EXCLALL')
  &ZCMD = 'X ALL'
IF (&ZCMD = 'EXCLUP')
  &ZCMD = 'X UP'
IF (&ZCMD = 'EXCLDN')
  &ZCMD = 'X DN'
IF (&ZCMD = 'N1')
  &ZCMD = 1
IF (&ZCMD = 'N2')
  &ZCMD = 2
IF (&ZCMD = 'N3')
  &ZCMD = 3
IF (&ZCMD = 'N4')
  &ZCMD = 4
IF (&ZCMD = 'N5')
  &ZCMD = 5
IF (&ZCMD = 'N6')
  &ZCMD = 6
IF (&ZCMD = 'N7')
  &ZCMD = 7
IF (&ZCMD = 'N8')
  &ZCMD = 8
IF (&ZCMD = 'N9')
  &ZCMD = 9
IF (&ZCMD = 'NUMBER')
  IF (&ZPSCAX1 = '')
    &ZCMD = 'SORT NUMBER ASCENDING'
    &ZPSCAX1 = ''     /*      NUMBER        */
    &ZPSCAX2 = ''     /*      VOLUME        */
    &ZPSCAX3 = ''     /*      DSNAME        */
    &ZPSCAX1 = 1
  ELSE
    &ZCMD = 'SORT NUMBER DESCENDING'
    &ZPSCAX1 = ''
IF (&ZCMD = 'VOLUME')
  IF (&ZPSCAX2 = '')
    &ZCMD = 'SORT VOLUME ASCENDING'
    &ZPSCAX1 = ''     /*      NUMBER        */
    &ZPSCAX2 = ''     /*      VOLUME        */
    &ZPSCAX3 = ''     /*      DSNAME        */
    &ZPSCAX2 = 1
  ELSE
    &ZCMD = 'SORT VOLUME DESCENDING'
    &ZPSCAX2 = ''
IF (&ZCMD = 'DSNAME')
  IF (&ZPSCAX3 = '')
    &ZCMD = 'SORT DSNAME ASCENDING'
    &ZPSCAX1 = ''     /*      NUMBER        */
    &ZPSCAX2 = ''     /*      VOLUME        */
    &ZPSCAX3 = ''     /*      DSNAME        */
    &ZPSCAX3 = 1
  ELSE
    &ZCMD = 'SORT DSNAME DESCENDING'
    &ZPSCAX3 = ''
)PNTS
FIELD(num) VAR(ZCMD) VAL('SORT NUMBER')
FIELD(vol) VAR(ZCMD) VAL('SORT VOLUME')
FIELD(dsn) VAR(ZCMD) VAL('SORT DSNAME')
)END
./ ADD NAME=P86PNRPS 0150-98141-16224-0713-00273-00024-00000-T311LBD 48
)ATTR DEFAULT(%+_)
    # TYPE(AB)    FORMAT(MIX)
    " TYPE(ABSL) GE(ON)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    ¬ TYPE(OUTPUT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
    @ TYPE(OUTPUT) INTENS(LOW)
    ! TYPE(OUTPUT) INTENS(LOW) JUST(RIGHT)
    } TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW) SKIP(ON) HILITE(USCORE)
    $ type(output) intens(high) caps(off) just(asis) pas(on) hilite(uscore)
)ABC DESC('Memlist') MNEM(1)
PDC DESC('All Members') MNEM(13)
 ACTION RUN(MLALL)
PDC DESC('Members Updated Today') MNEM(13)
 ACTION RUN(MLTO)
PDC DESC('Members Updated Yesterday') MNEM(13)
 ACTION RUN(MLYES)
PDC DESC('Members Updated Last 7 days') MNEM(13)
 ACTION RUN(MLWE)
PDC DESC('Members Updated Last 30 days') MNEM(13)
 ACTION RUN(MLMON)
PDC DESC('Members Updated Last 90 days') MNEM(13)
 ACTION RUN(MLQTR)
PDC DESC('Members Updated Last 365 days') MNEM(13)
 ACTION RUN(MLYR)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Functions') MNEM(1)
PDC DESC('List Allocations') MNEM(6)
 ACTION RUN(LA)
PDC DESC('List Files...') MNEM(6)
 ACTION RUN(LF)
PDC DESC('Active Catalog List') MNEM(3)
 ACTION RUN(CAX)
PDC DESC('Memlist...') MNEM(6)
 ACTION RUN(ML)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Function Menu...') MNEM(10)
 ACTION RUN(FN)
PDC DESC('Function Status') MNEM(10)
 ACTION RUN(FU)
PDC DESC('PDS TSO Command Table') MNEM(7)
 ACTION RUN(TCT)
PDC DESC('End PDS Session') MNEM(3)
 ACTION RUN(QUIT)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Options') MNEM(1)
PDC DESC('Subcommand Selection...') MNEM(3)
 ACTION RUN(O)
PDC DESC('Change Datasets') MNEM(1)
 ACTION RUN(CHANGE)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Special') MNEM(1)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N1)
PDC DESC('Clear Table') MNEM(5)
 ACTION RUN(N2)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N3)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N4)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N5)
PDC DESC('MEMLIST All') MNEM(9)
 ACTION RUN(N6)
PDC DESC('Output Table...') MNEM(3)
 ACTION RUN(N7)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Swap Panels') MNEM(6)
 ACTION RUN(N9)
PDC DESC('Sort Table...') MNEM(4)
 ACTION RUN(SORTPDC)
PDC DESC('Find in Table...') MNEM(4)
 ACTION RUN(FINDPDC)
PDC DESC('Exclude All') MNEM(10)
 ACTION RUN(EXCLALL)
PDC DESC('Exclude Above') MNEM(10)
 ACTION RUN(EXCLUP)
PDC DESC('Exclude Below') MNEM(10)
 ACTION RUN(EXCLDN)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Defaults') MNEM(1)
PDC DESC('Set Environmental Options') MNEM(6)
 ACTION RUN(SETENV)
PDC DESC('Set Select Alias Commands') MNEM(6)
 ACTION RUN(SETSEL)
PDC DESC('Set Log Limit Values') MNEM(6)
 ACTION RUN(SETLOG)
PDC DESC('Set Member List Options') MNEM(6)
 ACTION RUN(SETML)
PDC DESC('Set LISTV Options') MNEM(6)
 ACTION RUN(SETV)
PDC DESC('Set LISTC Options') MNEM(6)
 ACTION RUN(SETLF)
PDC DESC('Set TRAP Options') MNEM(6)
 ACTION RUN(SETTRAP)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Help') MNEM(1)
PDC PDCTEXT('List Volumes Display')
 ACTION RUN(HELP)
PDC PDCTEXT('PDS Full-screen Help')
 ACTION RUN(TSO) PARM('HEL PDS86')
PDC PDCTEXT('PDS Tutorial Directory')
 ACTION RUN(TUTOR) PARM('P86PN@PO')
PDC PDCTEXT('Undocumented Items')
 ACTION RUN(TUTOR) PARM('P86UNDOC')
PDC PDCTEXT('About PDS...')
 ACTION RUN(TUTOR) PARM('P86LOGO')
PDC PDCTEXT('PDS Birthday')
 ACTION RUN(TUTOR) PARM('P86BIRTH')
)ABCINIT
.ZVARS=ZCMD
)BODY EXPAND(\\)
%# Memlist# Functions# Options# Special# Defaults# Help+
"-------------------------------------------------------------------------------
+\ \¢List Volumes+\ \
%Command ===>¦ZCMD                                            %Scroll ===>_Z   +
Enter an ISPF command or a special control code:
+  -----------------------------------------------------------------------------
}CMD $vol   }  DATA  $deva$devt +MOUNT$use$space+ PRIM  ALT  F0    FREE FRAG
+----$name  +--------$addr$type  +ATTR$cnt$used + CYLINDERS  DSCB   VIR INDEX
)MODEL
_Z   ¬Z     _Z       @Z   @Z     @Z   @Z   @Z   !Z      !Z !Z    !Z    +!Z   +
)INIT
   &OPT3 = 1
   .HELP  = P86PNI@
   .ZVARS = '(ZSCBR PDSVOPT  PDSVVOL  PDSVDATA PDSVADDR PDSVTYPE +
            PDSVATTR PDSVCNT PDSVSPCU PDSVDCYL PDSVACYL +
            PDSVFMT0 PDSVVIRS PDSVFRAG)'
 &vol     = 'VOLUME'
 &deva    = 'DEV'
 &devt    = 'DEV'
 &use     = 'USE'
 &space   = 'SPACE'
 &name    = ' NAME'
 &addr    = 'ADDR'
 &type    = 'TYPE'
 &cnt     = 'CNT'
 &used    = ' USED'
)PROC
IF (&ZCMD = 'MLALL')
  &ZCMD = 'MEMLIST :'
IF (&ZCMD = 'MLTO')
  &ZCMD = 'MEMLIST : TODAY'
IF (&ZCMD = 'MLYES')
  &ZCMD = 'MEMLIST : YESTERDAY'
IF (&ZCMD = 'MLWE')
  &ZCMD = 'MEMLIST : WEEK'
IF (&ZCMD = 'MLMON')
  &ZCMD = 'MEMLIST : MONTH'
IF (&ZCMD = 'MLQTR')
  &ZCMD = 'MEMLIST : QUARTER'
IF (&ZCMD = 'MLYR')
  &ZCMD = 'MEMLIST : YEAR'
IF (&ZCMD = 'SORTPDC')
  &ZCMD = 'SORT ?'
IF (&ZCMD = 'FINDPDC')
  &ZCMD = 'F ?'
IF (&ZCMD = 'EXCLALL')
  &ZCMD = 'X ALL'
IF (&ZCMD = 'EXCLUP')
  &ZCMD = 'X UP'
IF (&ZCMD = 'EXCLDN')
  &ZCMD = 'X DN'
IF (&ZCMD = 'N1')
  &ZCMD = 1
IF (&ZCMD = 'N2')
  &ZCMD = 2
IF (&ZCMD = 'N3')
  &ZCMD = 3
IF (&ZCMD = 'N4')
  &ZCMD = 4
IF (&ZCMD = 'N5')
  &ZCMD = 5
IF (&ZCMD = 'N6')
  &ZCMD = 6
IF (&ZCMD = 'N7')
  &ZCMD = 7
IF (&ZCMD = 'N8')
  &ZCMD = 8
IF (&ZCMD = 'N9')
  &ZCMD = 9
IF (&ZCMD = 'VOLUME')
  IF (&ZPSLVX1 = '')
    &ZCMD = 'SORT VOLUME ASCENDING'
    &ZPSLVX1 = ''     /*      VOLUME        */
    &ZPSLVX2 = ''     /*      ADDRESS       */
    &ZPSLVX3 = ''     /*      DEVTYPE       */
    &ZPSLVX4 = ''     /*      COUNT         */
    &ZPSLVX5 = ''     /*      TOTAL         */
    &ZPSLVX6 = ''     /*      LARGEST       */
    &ZPSLVX7 = ''     /*      USED          */
    &ZPSLVX1 = 1
  ELSE
    &ZCMD = 'SORT VOLUME DESCENDING'
    &ZPSLVX1 = ''
IF (&ZCMD = 'ADDRESS')
  IF (&ZPSLVX2 = '')
    &ZCMD = 'SORT ADDRESS ASCENDING'
    &ZPSLVX1 = ''     /*      VOLUME        */
    &ZPSLVX2 = ''     /*      ADDRESS       */
    &ZPSLVX3 = ''     /*      DEVTYPE       */
    &ZPSLVX4 = ''     /*      COUNT         */
    &ZPSLVX5 = ''     /*      TOTAL         */
    &ZPSLVX6 = ''     /*      LARGEST       */
    &ZPSLVX7 = ''     /*      USED          */
    &ZPSLVX2 = 1
  ELSE
    &ZCMD = 'SORT ADDRESS DESCENDING'
    &ZPSLVX2 = ''
IF (&ZCMD = 'TYPE')
  IF (&ZPSLVX3 = '')
    &ZCMD = 'SORT TYPE ASCENDING'
    &ZPSLVX1 = ''     /*      VOLUME        */
    &ZPSLVX2 = ''     /*      ADDRESS       */
    &ZPSLVX3 = ''     /*      DEVTYPE       */
    &ZPSLVX4 = ''     /*      COUNT         */
    &ZPSLVX5 = ''     /*      TOTAL         */
    &ZPSLVX6 = ''     /*      LARGEST       */
    &ZPSLVX7 = ''     /*      USED          */
    &ZPSLVX3 = 1
  ELSE
    &ZCMD = 'SORT TYPE DESCENDING'
    &ZPSLVX3 = ''
IF (&ZCMD = 'COUNT')
  IF (&ZPSLVX4 = '')
    &ZCMD = 'SORT COUNT ASCENDING'
    &ZPSLVX1 = ''     /*      VOLUME        */
    &ZPSLVX2 = ''     /*      ADDRESS       */
    &ZPSLVX3 = ''     /*      DEVTYPE       */
    &ZPSLVX4 = ''     /*      COUNT         */
    &ZPSLVX5 = ''     /*      TOTAL         */
    &ZPSLVX6 = ''     /*      LARGEST       */
    &ZPSLVX7 = ''     /*      USED          */
    &ZPSLVX4 = 1
  ELSE
    &ZCMD = 'SORT COUNT DESCENDING'
    &ZPSLVX4 = ''
IF (&ZCMD = 'USED')
  IF (&ZPSLVX7 = '')
    &ZCMD = 'SORT USED ASCENDING'
    &ZPSLVX1 = ''     /*      VOLUME        */
    &ZPSLVX2 = ''     /*      ADDRESS       */
    &ZPSLVX3 = ''     /*      DEVTYPE       */
    &ZPSLVX4 = ''     /*      COUNT         */
    &ZPSLVX5 = ''     /*      TOTAL         */
    &ZPSLVX6 = ''     /*      LARGEST       */
    &ZPSLVX7 = ''     /*      USED          */
    &ZPSLVX7 = 1
  ELSE
    &ZCMD = 'SORT USED DESCENDING'
    &ZPSLVX7 = ''
)PNTS
FIELD(vol     ) VAR(ZCMD) VAL('SORT VOLUME')
FIELD(deva    ) VAR(ZCMD) VAL('SORT ADDRESS')
FIELD(devt    ) VAR(ZCMD) VAL('SORT TYPE')
FIELD(use     ) VAR(ZCMD) VAL('SORT COUNT')
FIELD(space   ) VAR(ZCMD) VAL('SORT USED ')
FIELD(name    ) VAR(ZCMD) VAL('SORT VOLUME')
FIELD(addr    ) VAR(ZCMD) VAL('SORT ADDRESS')
FIELD(type    ) VAR(ZCMD) VAL('SORT TYPE')
FIELD(cnt     ) VAR(ZCMD) VAL('SORT COUNT')
FIELD(used    ) VAR(ZCMD) VAL('SORT USED')
)END
./ ADD NAME=P86PNSPS 0143-98247-16224-0721-00389-00024-00000-T311LBD 58
)ATTR DEFAULT(%+_)
    # TYPE(AB)    FORMAT(MIX)
    " TYPE(ABSL) GE(ON)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    ¬ TYPE(OUTPUT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
    @ TYPE(OUTPUT) INTENS(LOW) COLOR(BLUE)
    } TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW) SKIP(ON) HILITE(USCORE)
    $ type(output) intens(high) caps(off) just(asis) pas(on) hilite(uscore)
)ABC DESC('Memlist') MNEM(1)
PDC DESC('All Members') MNEM(13)
 ACTION RUN(MLALL)
PDC DESC('Members Updated Today') MNEM(13)
 ACTION RUN(MLTO)
PDC DESC('Members Updated Yesterday') MNEM(13)
 ACTION RUN(MLYES)
PDC DESC('Members Updated Last 7 days') MNEM(13)
 ACTION RUN(MLWE)
PDC DESC('Members Updated Last 30 days') MNEM(13)
 ACTION RUN(MLMON)
PDC DESC('Members Updated Last 90 days') MNEM(13)
 ACTION RUN(MLQTR)
PDC DESC('Members Updated Last 365 days') MNEM(13)
 ACTION RUN(MLYR)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Functions') MNEM(1)
PDC DESC('List Allocations') MNEM(6)
 ACTION RUN(LA)
PDC DESC('List Volumes...') MNEM(6)
 ACTION RUN(LV)
PDC DESC('List Files...') MNEM(6)
 ACTION RUN(LF)
PDC DESC('Active Catalog List') MNEM(3)
 ACTION RUN(CAX)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Function Menu...') MNEM(10)
 ACTION RUN(FN)
PDC DESC('Function Status') MNEM(10)
 ACTION RUN(FU)
PDC DESC('PDS TSO Command Table') MNEM(7)
 ACTION RUN(TCT)
PDC DESC('Last 30 Referenced DSNAMEs') MNEM(7)
 ACTION RUN(REFLISTD)
PDC DESC('End PDS Session') MNEM(3)
 ACTION RUN(QUIT)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Options') MNEM(1)
PDC DESC('Subcommand Selection...') MNEM(3)
 ACTION RUN(O)
PDC DESC('PDS Generation Options') MNEM(3)
 ACTION RUN(CONTAPDC)
PDC DESC('IBM System Information') MNEM(3)
 ACTION RUN(CPU)
PDC DESC('Dataset Usage') MNEM(3)
 ACTION RUN(USAGAPDC)
PDC DESC('Change Datasets') MNEM(1)
 ACTION RUN(CHANGE)
PDC DESC('Change Dataset Menu...') MNEM(2)
 ACTION RUN(CHGMENU)
PDC DESC('Michael Theys Date Calendar...') MNEM(2)
 ACTION RUN(RCQDATE)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Special') MNEM(1)
PDC DESC('Suspend ISPF') MNEM(4)
 ACTION RUN(N1)
PDC DESC('Clear Table') MNEM(5)
 ACTION RUN(N2)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N3)
PDC DESC('Sublist = Memlist') MNEM(9)
 ACTION RUN(N4)
PDC DESC('Check Aliases') MNEM(9)
 ACTION RUN(N5)
PDC DESC('MEMLIST All') MNEM(9)
 ACTION RUN(N6)
PDC DESC('Output Table...') MNEM(3)
 ACTION RUN(N7)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Swap Panels') MNEM(6)
 ACTION RUN(N9)
PDC DESC('Sort Table...') MNEM(4)
 ACTION RUN(SORTPDC)
PDC DESC('Find in Table...') MNEM(4)
 ACTION RUN(FINDPDC)
PDC DESC('Exclude All') MNEM(10)
 ACTION RUN(EXCLALL)
PDC DESC('Exclude Above') MNEM(10)
 ACTION RUN(EXCLUP)
PDC DESC('Exclude Below') MNEM(10)
 ACTION RUN(EXCLDN)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Defaults') MNEM(1)
PDC DESC('Set Environmental Options') MNEM(6)
 ACTION RUN(SETENV)
PDC DESC('Set Select Alias Commands') MNEM(6)
 ACTION RUN(SETSEL)
PDC DESC('Set Log Limit Values') MNEM(6)
 ACTION RUN(SETLOG)
PDC DESC('Set Member List Options') MNEM(6)
 ACTION RUN(SETML)
PDC DESC('Set LISTV Options') MNEM(6)
 ACTION RUN(SETV)
PDC DESC('Set LISTC Options') MNEM(6)
 ACTION RUN(SETLF)
PDC DESC('Set TRAP Options') MNEM(6)
 ACTION RUN(SETTRAP)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Help') MNEM(1)
PDC PDCTEXT('MEMLIST Source Member List')
 ACTION RUN(HELP)
PDC PDCTEXT('PDS for Dummies')
 ACTION RUN(TUTOR) PARM('P86DUMI')
PDC PDCTEXT('PDS Full-screen Help')
 ACTION RUN(TSO) PARM('HEL PDS86')
PDC PDCTEXT('TSO Help Directory')
 ACTION RUN(TSO) PARM('%ZTSOHELP')
PDC PDCTEXT('PDS Tutorial Directory')
 ACTION RUN(TUTOR) PARM('P86PN@PO')
PDC PDCTEXT('PDS Quick Reference')
 ACTION RUN(QR)
PDC PDCTEXT('PDS Modifications')
 ACTION RUN(MODS)
PDC PDCTEXT('IBM Product Codes for Compilers')
 ACTION RUN(TRANS)
PDC PDCTEXT('DASD Geometry Chart')
 ACTION RUN(CONTGPDC)
PDC PDCTEXT('Undocumented Items')
 ACTION RUN(TUTOR) PARM('P86UNDOC')
PDC PDCTEXT('About PDS...')
 ACTION RUN(TUTOR) PARM('P86LOGO')
PDC PDCTEXT('PDS Birthday')
 ACTION RUN(TUTOR) PARM('P86BIRTH')
)ABCINIT
.ZVARS=ZCMD
)BODY EXPAND(\\)
%# Memlist# Functions# Options# Special# Defaults# Help+
"-------------------------------------------------------------------------------
+\ \¢MEMLIST Source Member List 3+\ \
%Command ===>¦ZCMD                                            %Scroll ===>_Z   +
Enter an ISPF command, a PDS subcommand or a special control code:
%&PDSMSG  ----------------------------------------------------------------------
}CMD $name    }DATA  $vmod   $created   $changed            $size +XSTAT$id
)MODEL
_Z   ¬Z       _Z     +@Z     @Z         @Z         @Z       @Z    +@Z   @Z
)INIT
   &OPT3 = 1
   .NRET = ON
   .HELP  = P86PN5@
   .ZVARS = '(ZSCBR MEMLOPT  MEMLNAME MEMLDATA MEMLVMOD +
            MEMLCDAX MEMLMDAX MEMLMTIM MEMLCSIZ MEMLXSTA MEMLMID)'
 &name    = 'NAME'
 &vmod    = 'VER.MOD'
 &created = '   CREATED'
 &changed = '      LAST MODIFIED'
 &size    = ' SIZE'
 &id      = 'ID'
)REINIT
   .NRET = ON
   REFRESH(*)
)PROC
IF (&ZCMD = 'MLALL')
  &ZCMD = 'MEMLIST :'
IF (&ZCMD = 'MLTO')
  &ZCMD = 'MEMLIST : TODAY'
IF (&ZCMD = 'MLYES')
  &ZCMD = 'MEMLIST : YESTERDAY'
IF (&ZCMD = 'MLWE')
  &ZCMD = 'MEMLIST : WEEK'
IF (&ZCMD = 'MLMON')
  &ZCMD = 'MEMLIST : MONTH'
IF (&ZCMD = 'MLQTR')
  &ZCMD = 'MEMLIST : QUARTER'
IF (&ZCMD = 'MLYR')
  &ZCMD = 'MEMLIST : YEAR'
IF (&ZCMD = 'SORTPDC')
  &ZCMD = 'SORT ?'
IF (&ZCMD = 'FINDPDC')
  &ZCMD = 'F ?'
IF (&ZCMD = 'CONTAPDC')
  &ZCMD = 'CONTROL ALL'
IF (&ZCMD = 'USAGAPDC')
  &ZCMD = 'USAGE ALL'
IF (&ZCMD = 'CONTGPDC')
  &ZCMD = 'CONTROL GEO'
IF (&ZCMD = 'EXCLALL')
  &ZCMD = 'X ALL'
IF (&ZCMD = 'EXCLUP')
  &ZCMD = 'X UP'
IF (&ZCMD = 'EXCLDN')
  &ZCMD = 'X DN'
IF (&ZCMD = 'CHGMENU')
  &ZCMD = 'O.UT.CHGMENU'
IF (&ZCMD = 'N1')
  &ZCMD = 1
IF (&ZCMD = 'N2')
  &ZCMD = 2
IF (&ZCMD = 'N3')
  &ZCMD = 3
IF (&ZCMD = 'N4')
  &ZCMD = 4
IF (&ZCMD = 'N5')
  &ZCMD = 5
IF (&ZCMD = 'N6')
  &ZCMD = 6
IF (&ZCMD = 'N7')
  &ZCMD = 7
IF (&ZCMD = 'N8')
  &ZCMD = 8
IF (&ZCMD = 'N9')
  &ZCMD = 9
IF (&ZCMD = 'NAME')
  IF (&ZPSMLS1 = '')
    &ZCMD = 'SORT NAME ASCENDING'
    &ZPSMLS1 = ''     /*      NAME          */
    &ZPSMLS2 = ''     /*      VERSION       */
    &ZPSMLS3 = ''     /*      CREATED       */
    &ZPSMLS4 = ''     /*      MODIFIED      */
    &ZPSMLS5 = ''     /*      SIZE          */
    &ZPSMLS6 = ''     /*      ID            */
    &ZPSMLS7 = ''     /*      TTR           */
    &ZPSMLS1 = 1
  ELSE
    &ZCMD = 'SORT NAME DESCENDING'
    &ZPSMLS1 = ''
IF (&ZCMD = 'VERSION')
  IF (&ZPSMLS2 = '')
    &ZCMD = 'SORT VERSION DESCENDING'
    &ZPSMLS1 = ''     /*      NAME          */
    &ZPSMLS2 = ''     /*      VERSION       */
    &ZPSMLS3 = ''     /*      CREATED       */
    &ZPSMLS4 = ''     /*      MODIFIED      */
    &ZPSMLS5 = ''     /*      SIZE          */
    &ZPSMLS6 = ''     /*      ID            */
    &ZPSMLS7 = ''     /*      TTR           */
    &ZPSMLS2 = 1
  ELSE
    &ZCMD = 'SORT VERSION ASCENDING'
    &ZPSMLS2 = ''
IF (&ZCMD = 'CREATED')
  IF (&ZPSMLS3 = '')
    &ZCMD = 'SORT CREATED DESCENDING'
    &ZPSMLS1 = ''     /*      NAME          */
    &ZPSMLS2 = ''     /*      VERSION       */
    &ZPSMLS3 = ''     /*      CREATED       */
    &ZPSMLS4 = ''     /*      MODIFIED      */
    &ZPSMLS5 = ''     /*      SIZE          */
    &ZPSMLS6 = ''     /*      ID            */
    &ZPSMLS7 = ''     /*      TTR           */
    &ZPSMLS3 = 1
  ELSE
    &ZCMD = 'SORT CREATED ASCENDING'
    &ZPSMLS3 = ''
IF (&ZCMD = 'MODIFIED')
  IF (&ZPSMLS4 = '')
    &ZCMD = 'SORT MODIFIED DESCENDING'
    &ZPSMLS1 = ''     /*      NAME          */
    &ZPSMLS2 = ''     /*      VERSION       */
    &ZPSMLS3 = ''     /*      CREATED       */
    &ZPSMLS4 = ''     /*      MODIFIED      */
    &ZPSMLS5 = ''     /*      SIZE          */
    &ZPSMLS6 = ''     /*      ID            */
    &ZPSMLS7 = ''     /*      TTR           */
    &ZPSMLS4 = 1
  ELSE
    &ZCMD = 'SORT MODIFIED ASCENDING'
    &ZPSMLS4 = ''
IF (&ZCMD = 'SIZE')
  IF (&ZPSMLS5 = '')
    &ZCMD = 'SORT SIZE DESCENDING'
    &ZPSMLS1 = ''     /*      NAME          */
    &ZPSMLS2 = ''     /*      VERSION       */
    &ZPSMLS3 = ''     /*      CREATED       */
    &ZPSMLS4 = ''     /*      MODIFIED      */
    &ZPSMLS5 = ''     /*      SIZE          */
    &ZPSMLS6 = ''     /*      ID            */
    &ZPSMLS7 = ''     /*      TTR           */
    &ZPSMLS5 = 1
  ELSE
    &ZCMD = 'SORT SIZE ASCENDING'
    &ZPSMLS5 = ''
IF (&ZCMD = 'ID')
  IF (&ZPSMLS6 = '')
    &ZCMD = 'SORT ID ASCENDING'
    &ZPSMLS1 = ''     /*      NAME          */
    &ZPSMLS2 = ''     /*      VERSION       */
    &ZPSMLS3 = ''     /*      CREATED       */
    &ZPSMLS4 = ''     /*      MODIFIED      */
    &ZPSMLS5 = ''     /*      SIZE          */
    &ZPSMLS6 = ''     /*      ID            */
    &ZPSMLS7 = ''     /*      TTR           */
    &ZPSMLS6 = 1
  ELSE
    &ZCMD = 'SORT ID DESCENDING'
    &ZPSMLS6 = ''

/* Start NRETRIEV code */
VGET (ZVERB)
.NRET = OFF
IF (&ZVERB = NRETRIEV)
  .NRET = DSN
  IF (&ZNRDS = YES)
    &ZCMD = 'C &ZNRODSN'
    .MSG = ISRDS014
  ELSE .MSG = ISRDS012
/* End NRETRIEV code */

/* Start RefList code */
VGET (ZRDSN ZRVOL) SHARED
IF (&ZRDSN ¬= ' ')
  VGET (ZREFVOLM) PROFILE
  IF (&ZREFVOLM = 'ON')
    &VOL1 = &ZRVOL
  ELSE                                                  /* OW15849*/
    &VOL1 = &Z                                          /* OW15849*/
  IF (&VOL1 = ' ')
    &ZCMD = 'C &ZRDSN'
  ELSE
    &ZCMD = 'C &ZRDSN VOL(&VOL1)'
  &ZDSVOL = &VOL1
  &ZRDSN = ' '
  &ZRVOL = ' '
  VPUT (ZRDSN ZRVOL) SHARED
  VPUT (ZDSVOL) SHARED
  VGET (ZELIST) PROFILE
  IF (&ZELIST ¬= 'EXECUTE') .MSG = ISRDS003
VGET (DSALSEL) SHARED
IF (&DSALSEL ¬= ' ')
  VGET (DSA1,DSA2,DSA6,DSA7) SHARED
  IF (&DSA7 = ' ')
    &ZCMD = 'C ''&DSA1..&DSA2..&DSA6'''
  ELSE
    &ZCMD = 'C ''&DSA1..&DSA2..&DSA6'';ML &DSA7'
  &DSALSEL = ' '
  VPUT (DSALSEL) SHARED
  VGET (ZELIST) PROFILE
  IF (&ZELIST ¬= 'EXECUTE') .MSG = ISRDS003
/* End RefList code */

&PPRE = TRUNC(&ZCMD,3)
IF (&PPRE = 'c ''' OR           /* cHANGE ' command?     */
    &PPRE = 'C ''')             /* Change ' command?     */
  &PDSN = TRUNC(&ZCMD,2)
  &PDSN = .TRAIL
  &PFC = TRUNC(&PDSN,1)         /* If first character    */
  IF (&PFC = '''')              /*   of DSN is "'" check */
    &PREM = .TRAIL              /*   to see if last "'"  */
    &PREM2 = TRUNC(&PREM,'''')  /*   is missing.         */
    IF (&PREM2 = &PREM)         /* If last "'" missing   */
      &ZCMD = '&ZCMD&PFC'       /*   add it to the end.  */

&PPRE = TRUNC(&ZCMD,4)
IF (&PPRE = 'ch ''' OR          /* ch-ANGE ' command?    */
    &PPRE = 'CH ''')            /* CH-ange ' command?    */
  &PDSN = TRUNC(&ZCMD,3)
  &PDSN = .TRAIL
  &PFC = TRUNC(&PDSN,1)         /* If first character    */
  IF (&PFC = '''')              /*   of DSN is "'" check */
    &PREM = .TRAIL              /*   to see if last "'"  */
    &PREM2 = TRUNC(&PREM,'''')  /*   is missing.         */
    IF (&PREM2 = &PREM)         /* If last "'" missing   */
      &ZCMD = '&ZCMD&PFC'       /*   add it to the end.  */

&PPRE = TRUNC(&ZCMD,5)
IF (&PPRE = 'cha ''' OR         /* cha-NGE ' command?    */
    &PPRE = 'CHA ''')           /* CHA-nge ' command?    */
  &PDSN = TRUNC(&ZCMD,4)
  &PDSN = .TRAIL
  &PFC = TRUNC(&PDSN,1)         /* If first character    */
  IF (&PFC = '''')              /*   of DSN is "'" check */
    &PREM = .TRAIL              /*   to see if last "'"  */
    &PREM2 = TRUNC(&PREM,'''')  /*   is missing.         */
    IF (&PREM2 = &PREM)         /* If last "'" missing   */
      &ZCMD = '&ZCMD&PFC'       /*   add it to the end.  */
)PNTS
FIELD(name    ) VAR(ZCMD) VAL('SORT NAME')
FIELD(vmod    ) VAR(ZCMD) VAL('SORT VERSION')
FIELD(created ) VAR(ZCMD) VAL('SORT CREATED')
FIELD(changed ) VAR(ZCMD) VAL('SORT MODIFIED')
FIELD(size    ) VAR(ZCMD) VAL('SORT SIZE')
FIELD(idS     ) VAR(ZCMD) VAL('SORT ID')
)END
./ ADD NAME=P86PN5PS 0199-98282-16218-1137-00392-00030-00000-T311LBD 00
)ATTR DEFAULT(%+_)
    # TYPE(AB)    FORMAT(MIX)
  01 type(output) intens(high) caps(off) just(left) pas(on) hilite(uscore)
  02 type(output) intens(high) caps(off) just(asis) pas(on) hilite(uscore)
    " TYPE(ABSL) GE(ON)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    ¬ TYPE(OUTPUT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
    @ TYPE(OUTPUT) INTENS(LOW) COLOR(BLUE)
    } TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW) SKIP(ON) HILITE(USCORE)
    { TYPE(TEXT) INTENS(HIGH) COLOR(GREEN) SKIP(ON)
    $ TYPE(PS)
)ABC DESC('Memlist') MNEM(1)
PDC DESC('All Members') MNEM(13)
 ACTION RUN(MLALL)
PDC DESC('Members Updated Today') MNEM(13)
 ACTION RUN(MLTO)
PDC DESC('Members Updated Yesterday') MNEM(13)
 ACTION RUN(MLYES)
PDC DESC('Members Updated Last 7 days') MNEM(13)
 ACTION RUN(MLWE)
PDC DESC('Members Updated Last 30 days') MNEM(13)
 ACTION RUN(MLMON)
PDC DESC('Members Updated Last 90 days') MNEM(13)
 ACTION RUN(MLQTR)
PDC DESC('Members Updated Last 365 days') MNEM(13)
 ACTION RUN(MLYR)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Functions') MNEM(1)
PDC DESC('List Allocations') MNEM(6)
 ACTION RUN(LA)
PDC DESC('List Volumes...') MNEM(6)
 ACTION RUN(LV)
PDC DESC('List Files...') MNEM(6)
 ACTION RUN(LF)
PDC DESC('Active Catalog List') MNEM(3)
 ACTION RUN(CAX)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Function Menu...') MNEM(10)
 ACTION RUN(FN)
PDC DESC('Function Status') MNEM(10)
 ACTION RUN(FU)
PDC DESC('PDS TSO Command Table') MNEM(7)
 ACTION RUN(TCT)
PDC DESC('Last 30 Referenced DSNAMEs') MNEM(7)
 ACTION RUN(REFLISTD)
PDC DESC('End PDS Session') MNEM(3)
 ACTION RUN(QUIT)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Options') MNEM(1)
PDC DESC('Subcommand Selection...') MNEM(3)
 ACTION RUN(O)
PDC DESC('PDS Generation Options') MNEM(3)
 ACTION RUN(CONTAPDC)
PDC DESC('IBM System Information') MNEM(3)
 ACTION RUN(CPU)
PDC DESC('Dataset Usage') MNEM(3)
 ACTION RUN(USAGAPDC)
PDC DESC('Change Datasets') MNEM(1)
 ACTION RUN(CHANGE)
PDC DESC('Change Dataset Menu...') MNEM(2)
 ACTION RUN(CHGMENU)
PDC DESC('Michael Theys Date Calendar...') MNEM(2)
 ACTION RUN(RCQDATE)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Special') MNEM(1)
PDC DESC('Suspend ISPF') MNEM(4)
 ACTION RUN(N1)
PDC DESC('Clear Table') MNEM(5)
 ACTION RUN(N2)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N3)
PDC DESC('Sublist = Memlist') MNEM(9)
 ACTION RUN(N4)
PDC DESC('Check Aliases') MNEM(9)
 ACTION RUN(N5)
PDC DESC('MEMLIST All') MNEM(9)
 ACTION RUN(N6)
PDC DESC('Output Table...') MNEM(3)
 ACTION RUN(N7)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Swap Panels') MNEM(6)
 ACTION RUN(N9)
PDC DESC('Sort Table...') MNEM(4)
 ACTION RUN(SORTPDC)
PDC DESC('Find in Table...') MNEM(4)
 ACTION RUN(FINDPDC)
PDC DESC('Exclude All') MNEM(10)
 ACTION RUN(EXCLALL)
PDC DESC('Exclude Above') MNEM(10)
 ACTION RUN(EXCLUP)
PDC DESC('Exclude Below') MNEM(10)
 ACTION RUN(EXCLDN)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Defaults') MNEM(1)
PDC DESC('Set Environmental Options') MNEM(6)
 ACTION RUN(SETENV)
PDC DESC('Set Select Alias Commands') MNEM(6)
 ACTION RUN(SETSEL)
PDC DESC('Set Log Limit Values') MNEM(6)
 ACTION RUN(SETLOG)
PDC DESC('Set Member List Options') MNEM(6)
 ACTION RUN(SETML)
PDC DESC('Set LISTV Options') MNEM(6)
 ACTION RUN(SETV)
PDC DESC('Set LISTC Options') MNEM(6)
 ACTION RUN(SETLF)
PDC DESC('Set TRAP Options') MNEM(6)
 ACTION RUN(SETTRAP)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Help') MNEM(1)
PDC PDCTEXT('MEMLIST Source Member List')
 ACTION RUN(HELP)
PDC PDCTEXT('PDS for Dummies')
 ACTION RUN(TUTOR) PARM('P86DUMI')
PDC PDCTEXT('PDS Full-screen Help')
 ACTION RUN(TSO) PARM('HEL PDS86')
PDC PDCTEXT('TSO Help Directory')
 ACTION RUN(TSO) PARM('%ZTSOHELP')
PDC PDCTEXT('PDS Tutorial Directory')
 ACTION RUN(TUTOR) PARM('P86PN@PO')
PDC PDCTEXT('PDS Quick Reference')
 ACTION RUN(QR)
PDC PDCTEXT('PDS Modifications')
 ACTION RUN(MODS)
PDC PDCTEXT('IBM Product Codes for Compilers')
 ACTION RUN(TRANS)
PDC PDCTEXT('DASD Geometry Chart')
 ACTION RUN(CONTGPDC)
PDC PDCTEXT('Undocumented Items')
 ACTION RUN(TUTOR) PARM('P86UNDOC')
PDC PDCTEXT('About PDS...')
 ACTION RUN(TUTOR) PARM('P86LOGO')
PDC PDCTEXT('PDS Birthday')
 ACTION RUN(TUTOR) PARM('P86BIRTH')
)ABCINIT
.ZVARS=ZCMD
)BODY EXPAND(\\)
%# Memlist# Functions# Options# Special# Defaults# Help+
"-------------------------------------------------------------------------------
+\ \¢MEMLIST Source Member List 1+\ \
%Command ===>¦ZCMD                                            %Scroll ===>_Z   +
Enter an ISPF command, a PDS subcommand or a special control code:
%&PDSMSG
}CMD NAME    }DATA    VERSION  CREATED  MODIFIED      SIZE  +INIT  ID
)MODEL
_Z   ¬Z       _Z       +@Z       @Z        @Z       @Z    @Z    @Z      @Z
)INIT
 &name = 'NAME'
 &version = ' VER.MOD'
 &created = ' CREATED'
 &modified = ' LAST MODIFIED'
 &size = 'SIZE'
 &id = 'ID'
   &OPT3 = 1
   .NRET = ON
   .HELP  = P86PN5@
   .ZVARS = '(ZSCBR MEMLOPT  MEMLNAME MEMLDATA MEMLVMOD +
            MEMLCDAT MEMLMDAT MEMLMTIM MEMLCSIZ MEMLISIZ MEMLMID)'
)REINIT
   .NRET = ON
   REFRESH(*)
)PROC
IF (&ZCMD = 'MLALL')
  &ZCMD = 'MEMLIST :'
IF (&ZCMD = 'MLTO')
  &ZCMD = 'MEMLIST : TODAY'
IF (&ZCMD = 'MLYES')
  &ZCMD = 'MEMLIST : YESTERDAY'
IF (&ZCMD = 'MLWE')
  &ZCMD = 'MEMLIST : WEEK'
IF (&ZCMD = 'MLMON')
  &ZCMD = 'MEMLIST : MONTH'
IF (&ZCMD = 'MLQTR')
  &ZCMD = 'MEMLIST : QUARTER'
IF (&ZCMD = 'MLYR')
  &ZCMD = 'MEMLIST : YEAR'
IF (&ZCMD = 'SORTPDC')
  &ZCMD = 'SORT ?'
IF (&ZCMD = 'FINDPDC')
  &ZCMD = 'F ?'
IF (&ZCMD = 'CONTAPDC')
  &ZCMD = 'CONTROL ALL'
IF (&ZCMD = 'USAGAPDC')
  &ZCMD = 'USAGE ALL'
IF (&ZCMD = 'CONTGPDC')
  &ZCMD = 'CONTROL GEO'
IF (&ZCMD = 'EXCLALL')
  &ZCMD = 'X ALL'
IF (&ZCMD = 'EXCLUP')
  &ZCMD = 'X UP'
IF (&ZCMD = 'EXCLDN')
  &ZCMD = 'X DN'
IF (&ZCMD = 'CHGMENU')
  &ZCMD = 'O.UT.CHGMENU'
IF (&ZCMD = 'N1')
  &ZCMD = 1
IF (&ZCMD = 'N2')
  &ZCMD = 2
IF (&ZCMD = 'N3')
  &ZCMD = 3
IF (&ZCMD = 'N4')
  &ZCMD = 4
IF (&ZCMD = 'N5')
  &ZCMD = 5
IF (&ZCMD = 'N6')
  &ZCMD = 6
IF (&ZCMD = 'N7')
  &ZCMD = 7
IF (&ZCMD = 'N8')
  &ZCMD = 8
IF (&ZCMD = 'N9')
  &ZCMD = 9
IF (&ZCMD = 'NAME')
  IF (&ZPSMLS1 = '')
    &ZCMD = 'SORT NAME ASCENDING'
    &ZPSMLS1 = ''     /*      NAME          */
    &ZPSMLS2 = ''     /*      VERSION       */
    &ZPSMLS3 = ''     /*      CREATED       */
    &ZPSMLS4 = ''     /*      MODIFIED      */
    &ZPSMLS5 = ''     /*      SIZE          */
    &ZPSMLS6 = ''     /*      ID            */
    &ZPSMLS7 = ''     /*      TTR           */
    &ZPSMLS1 = 1
  ELSE
    &ZCMD = 'SORT NAME DESCENDING'
    &ZPSMLS1 = ''
IF (&ZCMD = 'VERSION')
  IF (&ZPSMLS2 = '')
    &ZCMD = 'SORT VERSION DESCENDING'
    &ZPSMLS1 = ''     /*      NAME          */
    &ZPSMLS2 = ''     /*      VERSION       */
    &ZPSMLS3 = ''     /*      CREATED       */
    &ZPSMLS4 = ''     /*      MODIFIED      */
    &ZPSMLS5 = ''     /*      SIZE          */
    &ZPSMLS6 = ''     /*      ID            */
    &ZPSMLS7 = ''     /*      TTR           */
    &ZPSMLS2 = 1
  ELSE
    &ZCMD = 'SORT VERSION ASCENDING'
    &ZPSMLS2 = ''
IF (&ZCMD = 'CREATED')
  IF (&ZPSMLS3 = '')
    &ZCMD = 'SORT CREATED DESCENDING'
    &ZPSMLS1 = ''     /*      NAME          */
    &ZPSMLS2 = ''     /*      VERSION       */
    &ZPSMLS3 = ''     /*      CREATED       */
    &ZPSMLS4 = ''     /*      MODIFIED      */
    &ZPSMLS5 = ''     /*      SIZE          */
    &ZPSMLS6 = ''     /*      ID            */
    &ZPSMLS7 = ''     /*      TTR           */
    &ZPSMLS3 = 1
  ELSE
    &ZCMD = 'SORT CREATED ASCENDING'
    &ZPSMLS3 = ''
IF (&ZCMD = 'MODIFIED')
  IF (&ZPSMLS4 = '')
    &ZCMD = 'SORT MODIFIED DESCENDING'
    &ZPSMLS1 = ''     /*      NAME          */
    &ZPSMLS2 = ''     /*      VERSION       */
    &ZPSMLS3 = ''     /*      CREATED       */
    &ZPSMLS4 = ''     /*      MODIFIED      */
    &ZPSMLS5 = ''     /*      SIZE          */
    &ZPSMLS6 = ''     /*      ID            */
    &ZPSMLS7 = ''     /*      TTR           */
    &ZPSMLS4 = 1
  ELSE
    &ZCMD = 'SORT MODIFIED ASCENDING'
    &ZPSMLS4 = ''
IF (&ZCMD = 'SIZE')
  IF (&ZPSMLS5 = '')
    &ZCMD = 'SORT SIZE DESCENDING'
    &ZPSMLS1 = ''     /*      NAME          */
    &ZPSMLS2 = ''     /*      VERSION       */
    &ZPSMLS3 = ''     /*      CREATED       */
    &ZPSMLS4 = ''     /*      MODIFIED      */
    &ZPSMLS5 = ''     /*      SIZE          */
    &ZPSMLS6 = ''     /*      ID            */
    &ZPSMLS7 = ''     /*      TTR           */
    &ZPSMLS5 = 1
  ELSE
    &ZCMD = 'SORT SIZE ASCENDING'
    &ZPSMLS5 = ''
IF (&ZCMD = 'ID')
  IF (&ZPSMLS6 = '')
    &ZCMD = 'SORT ID ASCENDING'
    &ZPSMLS1 = ''     /*      NAME          */
    &ZPSMLS2 = ''     /*      VERSION       */
    &ZPSMLS3 = ''     /*      CREATED       */
    &ZPSMLS4 = ''     /*      MODIFIED      */
    &ZPSMLS5 = ''     /*      SIZE          */
    &ZPSMLS6 = ''     /*      ID            */
    &ZPSMLS7 = ''     /*      TTR           */
    &ZPSMLS6 = 1
  ELSE
    &ZCMD = 'SORT ID DESCENDING'
    &ZPSMLS6 = ''

/* Start NRETRIEV code */
VGET (ZVERB)
.NRET = OFF
IF (&ZVERB = NRETRIEV)
  .NRET = DSN
  IF (&ZNRDS = YES)
    &ZCMD = 'C &ZNRODSN'
    .MSG = ISRDS014
  ELSE .MSG = ISRDS012
/* End NRETRIEV code */

/* Start RefList code */
VGET (ZRDSN ZRVOL) SHARED
IF (&ZRDSN ¬= ' ')
  VGET (ZREFVOLM) PROFILE
  IF (&ZREFVOLM = 'ON')
    &VOL1 = &ZRVOL
  ELSE                                                  /* OW15849*/
    &VOL1 = &Z                                          /* OW15849*/
  IF (&VOL1 = ' ')
    &ZCMD = 'C &ZRDSN'
  ELSE
    &ZCMD = 'C &ZRDSN VOL(&VOL1)'
  &ZDSVOL = &VOL1
  &ZRDSN = ' '
  &ZRVOL = ' '
  VPUT (ZRDSN ZRVOL) SHARED
  VPUT (ZDSVOL) SHARED
  VGET (ZELIST) PROFILE
  IF (&ZELIST ¬= 'EXECUTE') .MSG = ISRDS003
VGET (DSALSEL) SHARED
IF (&DSALSEL ¬= ' ')
  VGET (DSA1,DSA2,DSA6,DSA7) SHARED
  IF (&DSA7 = ' ')
    &ZCMD = 'C ''&DSA1..&DSA2..&DSA6'''
  ELSE
    &ZCMD = 'C ''&DSA1..&DSA2..&DSA6'';ML &DSA7'
  &DSALSEL = ' '
  VPUT (DSALSEL) SHARED
  VGET (ZELIST) PROFILE
  IF (&ZELIST ¬= 'EXECUTE') .MSG = ISRDS003
/* End RefList code */

&PPRE = TRUNC(&ZCMD,3)
IF (&PPRE = 'c ''' OR           /* cHANGE ' command?     */
    &PPRE = 'C ''')             /* Change ' command?     */
  &PDSN = TRUNC(&ZCMD,2)
  &PDSN = .TRAIL
  &PFC = TRUNC(&PDSN,1)         /* If first character    */
  IF (&PFC = '''')              /*   of DSN is "'" check */
    &PREM = .TRAIL              /*   to see if last "'"  */
    &PREM2 = TRUNC(&PREM,'''')  /*   is missing.         */
    IF (&PREM2 = &PREM)         /* If last "'" missing   */
      &ZCMD = '&ZCMD&PFC'       /*   add it to the end.  */

&PPRE = TRUNC(&ZCMD,4)
IF (&PPRE = 'ch ''' OR          /* ch-ANGE ' command?    */
    &PPRE = 'CH ''')            /* CH-ange ' command?    */
  &PDSN = TRUNC(&ZCMD,3)
  &PDSN = .TRAIL
  &PFC = TRUNC(&PDSN,1)         /* If first character    */
  IF (&PFC = '''')              /*   of DSN is "'" check */
    &PREM = .TRAIL              /*   to see if last "'"  */
    &PREM2 = TRUNC(&PREM,'''')  /*   is missing.         */
    IF (&PREM2 = &PREM)         /* If last "'" missing   */
      &ZCMD = '&ZCMD&PFC'       /*   add it to the end.  */

&PPRE = TRUNC(&ZCMD,5)
IF (&PPRE = 'cha ''' OR         /* cha-NGE ' command?    */
    &PPRE = 'CHA ''')           /* CHA-nge ' command?    */
  &PDSN = TRUNC(&ZCMD,4)
  &PDSN = .TRAIL
  &PFC = TRUNC(&PDSN,1)         /* If first character    */
  IF (&PFC = '''')              /*   of DSN is "'" check */
    &PREM = .TRAIL              /*   to see if last "'"  */
    &PREM2 = TRUNC(&PREM,'''')  /*   is missing.         */
    IF (&PREM2 = &PREM)         /* If last "'" missing   */
      &ZCMD = '&ZCMD&PFC'       /*   add it to the end.  */
)PNTS
FIELD(name)     VAR(ZCMD) VAL('SORT NAME')
FIELD(version)  VAR(ZCMD) VAL('SORT VERSION')
FIELD(created)  VAR(ZCMD) VAL('SORT CREATED')
FIELD(modified) VAR(ZCMD) VAL('SORT MODIFIED')
FIELD(size)     VAR(ZCMD) VAL('SORT SIZE')
FIELD(id)       VAR(ZCMD) VAL('SORT ID')
)END
./ ADD NAME=P86PN6PS 0130-98282-16224-0704-00389-00046-00000-T311LBD 46
)ATTR DEFAULT(%+_)
    # TYPE(AB)    FORMAT(MIX)
    " TYPE(ABSL) GE(ON)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    ¬ TYPE(OUTPUT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
    @ TYPE(OUTPUT) INTENS(LOW)
    } TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW) SKIP(ON) HILITE(USCORE)
    $ type(output) intens(high) caps(off) just(asis) pas(on) hilite(uscore)
)ABC DESC('Memlist') MNEM(1)
PDC DESC('All Members') MNEM(13)
 ACTION RUN(MLALL)
PDC DESC('Members Updated Today') MNEM(13)
 ACTION RUN(MLTO)
PDC DESC('Members Updated Yesterday') MNEM(13)
 ACTION RUN(MLYES)
PDC DESC('Members Updated Last 7 days') MNEM(13)
 ACTION RUN(MLWE)
PDC DESC('Members Updated Last 30 days') MNEM(13)
 ACTION RUN(MLMON)
PDC DESC('Members Updated Last 90 days') MNEM(13)
 ACTION RUN(MLQTR)
PDC DESC('Members Updated Last 365 days') MNEM(13)
 ACTION RUN(MLYR)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Functions') MNEM(1)
PDC DESC('List Allocations') MNEM(6)
 ACTION RUN(LA)
PDC DESC('List Volumes...') MNEM(6)
 ACTION RUN(LV)
PDC DESC('List Files...') MNEM(6)
 ACTION RUN(LF)
PDC DESC('Active Catalog List') MNEM(3)
 ACTION RUN(CAX)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Function Menu...') MNEM(10)
 ACTION RUN(FN)
PDC DESC('Function Status') MNEM(10)
 ACTION RUN(FU)
PDC DESC('PDS TSO Command Table') MNEM(7)
 ACTION RUN(TCT)
PDC DESC('Last 30 Referenced DSNAMEs') MNEM(7)
 ACTION RUN(REFLISTD)
PDC DESC('End PDS Session') MNEM(3)
 ACTION RUN(QUIT)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Options') MNEM(1)
PDC DESC('Subcommand Selection...') MNEM(3)
 ACTION RUN(O)
PDC DESC('PDS Generation Options') MNEM(3)
 ACTION RUN(CONTAPDC)
PDC DESC('IBM System Information') MNEM(3)
 ACTION RUN(CPU)
PDC DESC('Dataset Usage') MNEM(3)
 ACTION RUN(USAGAPDC)
PDC DESC('Change Datasets') MNEM(1)
 ACTION RUN(CHANGE)
PDC DESC('Change Dataset Menu...') MNEM(2)
 ACTION RUN(CHGMENU)
PDC DESC('Michael Theys Date Calendar...') MNEM(2)
 ACTION RUN(RCQDATE)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Special') MNEM(1)
PDC DESC('Suspend ISPF') MNEM(4)
 ACTION RUN(N1)
PDC DESC('Clear Table') MNEM(5)
 ACTION RUN(N2)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N3)
PDC DESC('Sublist = Memlist') MNEM(9)
 ACTION RUN(N4)
PDC DESC('Check Aliases') MNEM(9)
 ACTION RUN(N5)
PDC DESC('MEMLIST All') MNEM(9)
 ACTION RUN(N6)
PDC DESC('Output Table...') MNEM(3)
 ACTION RUN(N7)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Swap Panels') MNEM(6)
 ACTION RUN(N9)
PDC DESC('Sort Table...') MNEM(4)
 ACTION RUN(SORTPDC)
PDC DESC('Find in Table...') MNEM(4)
 ACTION RUN(FINDPDC)
PDC DESC('Exclude All') MNEM(10)
 ACTION RUN(EXCLALL)
PDC DESC('Exclude Above') MNEM(10)
 ACTION RUN(EXCLUP)
PDC DESC('Exclude Below') MNEM(10)
 ACTION RUN(EXCLDN)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Defaults') MNEM(1)
PDC DESC('Set Environmental Options') MNEM(6)
 ACTION RUN(SETENV)
PDC DESC('Set Select Alias Commands') MNEM(6)
 ACTION RUN(SETSEL)
PDC DESC('Set Log Limit Values') MNEM(6)
 ACTION RUN(SETLOG)
PDC DESC('Set Member List Options') MNEM(6)
 ACTION RUN(SETML)
PDC DESC('Set LISTV Options') MNEM(6)
 ACTION RUN(SETV)
PDC DESC('Set LISTC Options') MNEM(6)
 ACTION RUN(SETLF)
PDC DESC('Set TRAP Options') MNEM(6)
 ACTION RUN(SETTRAP)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Help') MNEM(1)
PDC PDCTEXT('MEMLIST Source Member List')
 ACTION RUN(HELP)
PDC PDCTEXT('PDS for Dummies')
 ACTION RUN(TUTOR) PARM('P86DUMI')
PDC PDCTEXT('PDS Full-screen Help')
 ACTION RUN(TSO) PARM('HEL PDS86')
PDC PDCTEXT('TSO Help Directory')
 ACTION RUN(TSO) PARM('%ZTSOHELP')
PDC PDCTEXT('PDS Tutorial Directory')
 ACTION RUN(TUTOR) PARM('P86PN@PO')
PDC PDCTEXT('PDS Quick Reference')
 ACTION RUN(QR)
PDC PDCTEXT('PDS Modifications')
 ACTION RUN(MODS)
PDC PDCTEXT('IBM Product Codes for Compilers')
 ACTION RUN(TRANS)
PDC PDCTEXT('DASD Geometry Chart')
 ACTION RUN(CONTGPDC)
PDC PDCTEXT('Undocumented Items')
 ACTION RUN(TUTOR) PARM('P86UNDOC')
PDC PDCTEXT('About PDS...')
 ACTION RUN(TUTOR) PARM('P86LOGO')
PDC PDCTEXT('PDS Birthday')
 ACTION RUN(TUTOR) PARM('P86BIRTH')
)ABCINIT
.ZVARS=ZCMD
)BODY EXPAND(\\)
%# Memlist# Functions# Options# Special# Defaults# Help+
"-------------------------------------------------------------------------------
+\ \¢MEMLIST Source Member List 2+\ \
%Command ===>¦ZCMD                                            %Scroll ===>_Z   +
Enter an ISPF command, a PDS subcommand or a special control code:
%&PDSMSG  ----------------------------------------------------------------------
}CMD $name    }DATA    +ALIASOF  $ttr     $vmod    $changed       $size $id
)MODEL
_Z   ¬Z       _Z       @Z        @Z        @Z      @Z       @Z    @Z    @Z
)INIT
   &OPT3 = 1
   .NRET = ON
   .HELP  = P86PN6@
   .ZVARS = '(ZSCBR MEMLOPT  MEMLNAME MEMLDATA MEMLALIS MEMLTTR  +
            MEMLVMOD MEMLMDAT MEMLMTIM MEMLCSIZ MEMLMID)'
 &name   = 'NAME'
 &ttr    = 'TTR'
 &vmod   = 'VER.MOD'
 &changed = 'LAST MODIFIED'
 &size   = ' SIZE'
 &id     = 'ID'
)REINIT
   .NRET = ON
   REFRESH(*)
)PROC
IF (&ZCMD = 'MLALL')
  &ZCMD = 'MEMLIST :'
IF (&ZCMD = 'MLTO')
  &ZCMD = 'MEMLIST : TODAY'
IF (&ZCMD = 'MLYES')
  &ZCMD = 'MEMLIST : YESTERDAY'
IF (&ZCMD = 'MLWE')
  &ZCMD = 'MEMLIST : WEEK'
IF (&ZCMD = 'MLMON')
  &ZCMD = 'MEMLIST : MONTH'
IF (&ZCMD = 'MLQTR')
  &ZCMD = 'MEMLIST : QUARTER'
IF (&ZCMD = 'MLYR')
  &ZCMD = 'MEMLIST : YEAR'
IF (&ZCMD = 'SORTPDC')
  &ZCMD = 'SORT ?'
IF (&ZCMD = 'FINDPDC')
  &ZCMD = 'F ?'
IF (&ZCMD = 'CONTAPDC')
  &ZCMD = 'CONTROL ALL'
IF (&ZCMD = 'USAGAPDC')
  &ZCMD = 'USAGE ALL'
IF (&ZCMD = 'CONTGPDC')
  &ZCMD = 'CONTROL GEO'
IF (&ZCMD = 'EXCLALL')
  &ZCMD = 'X ALL'
IF (&ZCMD = 'EXCLUP')
  &ZCMD = 'X UP'
IF (&ZCMD = 'EXCLDN')
  &ZCMD = 'X DN'
IF (&ZCMD = 'CHGMENU')
  &ZCMD = 'O.UT.CHGMENU'
IF (&ZCMD = 'N1')
  &ZCMD = 1
IF (&ZCMD = 'N2')
  &ZCMD = 2
IF (&ZCMD = 'N3')
  &ZCMD = 3
IF (&ZCMD = 'N4')
  &ZCMD = 4
IF (&ZCMD = 'N5')
  &ZCMD = 5
IF (&ZCMD = 'N6')
  &ZCMD = 6
IF (&ZCMD = 'N7')
  &ZCMD = 7
IF (&ZCMD = 'N8')
  &ZCMD = 8
IF (&ZCMD = 'N9')
  &ZCMD = 9
IF (&ZCMD = 'NAME')
  IF (&ZPSMLS1 = '')
    &ZCMD = 'SORT NAME ASCENDING'
    &ZPSMLS1 = ''     /*      NAME          */
    &ZPSMLS2 = ''     /*      VERSION       */
    &ZPSMLS3 = ''     /*      CREATED       */
    &ZPSMLS4 = ''     /*      MODIFIED      */
    &ZPSMLS5 = ''     /*      SIZE          */
    &ZPSMLS6 = ''     /*      ID            */
    &ZPSMLS7 = ''     /*      TTR           */
    &ZPSMLS1 = 1
  ELSE
    &ZCMD = 'SORT NAME DESCENDING'
    &ZPSMLS1 = ''
IF (&ZCMD = 'TTR')
  IF (&ZPSMLS7 = '')
    &ZCMD = 'SORT TTR ASCENDING'
    &ZPSMLS1 = ''     /*      NAME          */
    &ZPSMLS2 = ''     /*      VERSION       */
    &ZPSMLS3 = ''     /*      CREATED       */
    &ZPSMLS4 = ''     /*      MODIFIED      */
    &ZPSMLS5 = ''     /*      SIZE          */
    &ZPSMLS6 = ''     /*      ID            */
    &ZPSMLS7 = ''     /*      TTR           */
    &ZPSMLS7 = 1
  ELSE
    &ZCMD = 'SORT TTR DESCENDING'
    &ZPSMLS7 = ''
IF (&ZCMD = 'VERSION')
  IF (&ZPSMLS2 = '')
    &ZCMD = 'SORT VERSION DESCENDING'
    &ZPSMLS1 = ''     /*      NAME          */
    &ZPSMLS2 = ''     /*      VERSION       */
    &ZPSMLS3 = ''     /*      CREATED       */
    &ZPSMLS4 = ''     /*      MODIFIED      */
    &ZPSMLS5 = ''     /*      SIZE          */
    &ZPSMLS6 = ''     /*      ID            */
    &ZPSMLS7 = ''     /*      TTR           */
    &ZPSMLS2 = 1
  ELSE
    &ZCMD = 'SORT VERSION ASCENDING'
    &ZPSMLS2 = ''
IF (&ZCMD = 'MODIFIED')
  IF (&ZPSMLS4 = '')
    &ZCMD = 'SORT MODIFIED DESCENDING'
    &ZPSMLS1 = ''     /*      NAME          */
    &ZPSMLS2 = ''     /*      VERSION       */
    &ZPSMLS3 = ''     /*      CREATED       */
    &ZPSMLS4 = ''     /*      MODIFIED      */
    &ZPSMLS5 = ''     /*      SIZE          */
    &ZPSMLS6 = ''     /*      ID            */
    &ZPSMLS7 = ''     /*      TTR           */
    &ZPSMLS4 = 1
  ELSE
    &ZCMD = 'SORT MODIFIED ASCENDING'
    &ZPSMLS4 = ''
IF (&ZCMD = 'SIZE')
  IF (&ZPSMLS5 = '')
    &ZCMD = 'SORT SIZE DESCENDING'
    &ZPSMLS1 = ''     /*      NAME          */
    &ZPSMLS2 = ''     /*      VERSION       */
    &ZPSMLS3 = ''     /*      CREATED       */
    &ZPSMLS4 = ''     /*      MODIFIED      */
    &ZPSMLS5 = ''     /*      SIZE          */
    &ZPSMLS6 = ''     /*      ID            */
    &ZPSMLS7 = ''     /*      TTR           */
    &ZPSMLS5 = 1
  ELSE
    &ZCMD = 'SORT SIZE ASCENDING'
    &ZPSMLS5 = ''
IF (&ZCMD = 'ID')
  IF (&ZPSMLS6 = '')
    &ZCMD = 'SORT ID ASCENDING'
    &ZPSMLS1 = ''     /*      NAME          */
    &ZPSMLS2 = ''     /*      VERSION       */
    &ZPSMLS3 = ''     /*      CREATED       */
    &ZPSMLS4 = ''     /*      MODIFIED      */
    &ZPSMLS5 = ''     /*      SIZE          */
    &ZPSMLS6 = ''     /*      ID            */
    &ZPSMLS7 = ''     /*      TTR           */
    &ZPSMLS6 = 1
  ELSE
    &ZCMD = 'SORT ID DESCENDING'
    &ZPSMLS6 = ''

/* Start NRETRIEV code */
VGET (ZVERB)
.NRET = OFF
IF (&ZVERB = NRETRIEV)
  .NRET = DSN
  IF (&ZNRDS = YES)
    &ZCMD = 'C &ZNRODSN'
    .MSG = ISRDS014
  ELSE .MSG = ISRDS012
/* End NRETRIEV code */

/* Start RefList code */
VGET (ZRDSN ZRVOL) SHARED
IF (&ZRDSN ¬= ' ')
  VGET (ZREFVOLM) PROFILE
  IF (&ZREFVOLM = 'ON')
    &VOL1 = &ZRVOL
  ELSE                                                  /* OW15849*/
    &VOL1 = &Z                                          /* OW15849*/
  IF (&VOL1 = ' ')
    &ZCMD = 'C &ZRDSN'
  ELSE
    &ZCMD = 'C &ZRDSN VOL(&VOL1)'
  &ZDSVOL = &VOL1
  &ZRDSN = ' '
  &ZRVOL = ' '
  VPUT (ZRDSN ZRVOL) SHARED
  VPUT (ZDSVOL) SHARED
  VGET (ZELIST) PROFILE
  IF (&ZELIST ¬= 'EXECUTE') .MSG = ISRDS003
VGET (DSALSEL) SHARED
IF (&DSALSEL ¬= ' ')
  VGET (DSA1,DSA2,DSA6,DSA7) SHARED
  IF (&DSA7 = ' ')
    &ZCMD = 'C ''&DSA1..&DSA2..&DSA6'''
  ELSE
    &ZCMD = 'C ''&DSA1..&DSA2..&DSA6'';ML &DSA7'
  &DSALSEL = ' '
  VPUT (DSALSEL) SHARED
  VGET (ZELIST) PROFILE
  IF (&ZELIST ¬= 'EXECUTE') .MSG = ISRDS003
/* End RefList code */

&PPRE = TRUNC(&ZCMD,3)
IF (&PPRE = 'c ''' OR           /* cHANGE ' command?     */
    &PPRE = 'C ''')             /* Change ' command?     */
  &PDSN = TRUNC(&ZCMD,2)
  &PDSN = .TRAIL
  &PFC = TRUNC(&PDSN,1)         /* If first character    */
  IF (&PFC = '''')              /*   of DSN is "'" check */
    &PREM = .TRAIL              /*   to see if last "'"  */
    &PREM2 = TRUNC(&PREM,'''')  /*   is missing.         */
    IF (&PREM2 = &PREM)         /* If last "'" missing   */
      &ZCMD = '&ZCMD&PFC'       /*   add it to the end.  */

&PPRE = TRUNC(&ZCMD,4)
IF (&PPRE = 'ch ''' OR          /* ch-ANGE ' command?    */
    &PPRE = 'CH ''')            /* CH-ange ' command?    */
  &PDSN = TRUNC(&ZCMD,3)
  &PDSN = .TRAIL
  &PFC = TRUNC(&PDSN,1)         /* If first character    */
  IF (&PFC = '''')              /*   of DSN is "'" check */
    &PREM = .TRAIL              /*   to see if last "'"  */
    &PREM2 = TRUNC(&PREM,'''')  /*   is missing.         */
    IF (&PREM2 = &PREM)         /* If last "'" missing   */
      &ZCMD = '&ZCMD&PFC'       /*   add it to the end.  */

&PPRE = TRUNC(&ZCMD,5)
IF (&PPRE = 'cha ''' OR         /* cha-NGE ' command?    */
    &PPRE = 'CHA ''')           /* CHA-nge ' command?    */
  &PDSN = TRUNC(&ZCMD,4)
  &PDSN = .TRAIL
  &PFC = TRUNC(&PDSN,1)         /* If first character    */
  IF (&PFC = '''')              /*   of DSN is "'" check */
    &PREM = .TRAIL              /*   to see if last "'"  */
    &PREM2 = TRUNC(&PREM,'''')  /*   is missing.         */
    IF (&PREM2 = &PREM)         /* If last "'" missing   */
      &ZCMD = '&ZCMD&PFC'       /*   add it to the end.  */
)PNTS
FIELD(name    ) VAR(ZCMD) VAL('SORT NAME')
FIELD(ttr     ) VAR(ZCMD) VAL('SORT TTR')
FIELD(vmod    ) VAR(ZCMD) VAL('SORT VERSION')
FIELD(changed ) VAR(ZCMD) VAL('SORT MODIFIED')
FIELD(size    ) VAR(ZCMD) VAL('SORT SIZE')
FIELD(id      ) VAR(ZCMD) VAL('SORT ID')
)END
./ ADD NAME=P86PN7PS 0140-98282-16218-1216-00426-00034-00000-T311LBD 43
)ATTR DEFAULT(%+_)
  01 type(output) intens(high) caps(off) just(left) pas(on) hilite(uscore)
  02 type(output) intens(high) caps(off) just(asis) pas(on) hilite(uscore)
    # TYPE(AB)    FORMAT(MIX)
    " TYPE(ABSL) GE(ON)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    ¬ TYPE(OUTPUT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
    @ TYPE(OUTPUT) INTENS(LOW)
    } TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW) SKIP(ON) HILITE(USCORE)
    $ TYPE(PS)
)ABC DESC('Memlist') MNEM(1)
PDC DESC('All Members') MNEM(13)
 ACTION RUN(MLALL)
PDC DESC('Members Updated Today') MNEM(13)
 ACTION RUN(MLTO)
PDC DESC('Members Updated Yesterday') MNEM(13)
 ACTION RUN(MLYES)
PDC DESC('Members Updated Last 7 days') MNEM(13)
 ACTION RUN(MLWE)
PDC DESC('Members Updated Last 30 days') MNEM(13)
 ACTION RUN(MLMON)
PDC DESC('Members Updated Last 90 days') MNEM(13)
 ACTION RUN(MLQTR)
PDC DESC('Members Updated Last 365 days') MNEM(13)
 ACTION RUN(MLYR)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Functions') MNEM(1)
PDC DESC('List Allocations') MNEM(6)
 ACTION RUN(LA)
PDC DESC('List Volumes...') MNEM(6)
 ACTION RUN(LV)
PDC DESC('List Files...') MNEM(6)
 ACTION RUN(LF)
PDC DESC('Active Catalog List') MNEM(3)
 ACTION RUN(CAX)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Function Menu...') MNEM(10)
 ACTION RUN(FN)
PDC DESC('Function Status') MNEM(10)
 ACTION RUN(FU)
PDC DESC('PDS TSO Command Table') MNEM(7)
 ACTION RUN(TCT)
PDC DESC('Last 30 Referenced DSNAMEs') MNEM(7)
 ACTION RUN(REFLISTD)
PDC DESC('End PDS Session') MNEM(3)
 ACTION RUN(QUIT)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Options') MNEM(1)
PDC DESC('Subcommand Selection...') MNEM(3)
 ACTION RUN(O)
PDC DESC('PDS Generation Options') MNEM(3)
 ACTION RUN(CONTAPDC)
PDC DESC('IBM System Information') MNEM(3)
 ACTION RUN(CPU)
PDC DESC('Dataset Usage') MNEM(3)
 ACTION RUN(USAGAPDC)
PDC DESC('Change Datasets') MNEM(1)
 ACTION RUN(CHANGE)
PDC DESC('Change Dataset Menu...') MNEM(2)
 ACTION RUN(CHGMENU)
PDC DESC('Michael Theys Date Calendar...') MNEM(2)
 ACTION RUN(RCQDATE)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Special') MNEM(1)
PDC DESC('Suspend ISPF') MNEM(4)
 ACTION RUN(N1)
PDC DESC('Clear Table') MNEM(5)
 ACTION RUN(N2)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N3)
PDC DESC('Sublist = Memlist') MNEM(9)
 ACTION RUN(N4)
PDC DESC('Check Aliases') MNEM(9)
 ACTION RUN(N5)
PDC DESC('MEMLIST All') MNEM(9)
 ACTION RUN(N6)
PDC DESC('Output Table...') MNEM(3)
 ACTION RUN(N7)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Swap Panels') MNEM(6)
 ACTION RUN(N9)
PDC DESC('Sort Table...') MNEM(4)
 ACTION RUN(SORTPDC)
PDC DESC('Find in Table...') MNEM(4)
 ACTION RUN(FINDPDC)
PDC DESC('Exclude All') MNEM(10)
 ACTION RUN(EXCLALL)
PDC DESC('Exclude Above') MNEM(10)
 ACTION RUN(EXCLUP)
PDC DESC('Exclude Below') MNEM(10)
 ACTION RUN(EXCLDN)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Defaults') MNEM(1)
PDC DESC('Set Environmental Options') MNEM(6)
 ACTION RUN(SETENV)
PDC DESC('Set Select Alias Commands') MNEM(6)
 ACTION RUN(SETSEL)
PDC DESC('Set Log Limit Values') MNEM(6)
 ACTION RUN(SETLOG)
PDC DESC('Set Member List Options') MNEM(6)
 ACTION RUN(SETML)
PDC DESC('Set LISTV Options') MNEM(6)
 ACTION RUN(SETV)
PDC DESC('Set LISTC Options') MNEM(6)
 ACTION RUN(SETLF)
PDC DESC('Set TRAP Options') MNEM(6)
 ACTION RUN(SETTRAP)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Help') MNEM(1)
PDC PDCTEXT('MEMLIST Load Member List')
 ACTION RUN(HELP)
PDC PDCTEXT('PDS Full-screen Help')
 ACTION RUN(TSO) PARM('HEL PDS86')
PDC PDCTEXT('PDS Tutorial Directory')
 ACTION RUN(TUTOR) PARM('P86PN@PO')
PDC PDCTEXT('PDS Quick Reference')
 ACTION RUN(QR)
PDC PDCTEXT('PDS Modifications')
 ACTION RUN(MODS)
PDC PDCTEXT('IBM Product Codes for Compilers')
 ACTION RUN(TRANS)
PDC PDCTEXT('DASD Geometry Chart')
 ACTION RUN(CONTGPDC)
PDC PDCTEXT('Undocumented Items')
 ACTION RUN(TUTOR) PARM('P86UNDOC')
PDC PDCTEXT('About PDS...')
 ACTION RUN(TUTOR) PARM('P86LOGO')
PDC PDCTEXT('PDS Birthday')
 ACTION RUN(TUTOR) PARM('P86BIRTH')
)ABCINIT
.ZVARS=ZCMD
)BODY EXPAND(\\)
%# Memlist# Functions# Options# Special# Defaults# Help+
"-------------------------------------------------------------------------------
+\ \¢MEMLIST Load Member List 1+\ \
%Command ===>¦ZCMD                                            %Scroll ===>_Z   +
Enter an ISPF command a PDS subcommand or a special control code:
%&PDSMSG  ----------------------------------------------------------------------
}CMD NAME    }DATA    +ALIASOF CREATE  +  -- LMATTR    +  --ACMODE+MAIN+
)MODEL
_Z   ¬Z       _Z       @Z       @Z         @Z   @Z   @Z   @Z    @Z@Z   @Z
)INIT
 &name     = 'NAME'
 &create   = 'LEN/LKED'
 &lmattr   = 'ATTRIBUTES'
 &auth     = 'ACS'
 &ac       = 'AC'
 &mode     = 'MODE'
 &main     = 'MAIN'
   &OPT3 = 1
   .NRET = ON
   .HELP  = P86PN7@
   .ZVARS = '(ZSCBR MEMLOPT  MEMLNAME MEMLDATA MEMLALIS MEMLLDAX +
            MEMLATT1 MEMLATT2 MEMLDC   MEMLTEST MEMLAPFX MEMLMODE MEMLMNAM)'
)REINIT
   .NRET = ON
   REFRESH(*)
)PROC
IF (&ZCMD = 'MLALL')
  &ZCMD = 'MEMLIST :'
IF (&ZCMD = 'MLTO')
  &ZCMD = 'MEMLIST : TODAY'
IF (&ZCMD = 'MLYES')
  &ZCMD = 'MEMLIST : YESTERDAY'
IF (&ZCMD = 'MLWE')
  &ZCMD = 'MEMLIST : WEEK'
IF (&ZCMD = 'MLMON')
  &ZCMD = 'MEMLIST : MONTH'
IF (&ZCMD = 'MLQTR')
  &ZCMD = 'MEMLIST : QUARTER'
IF (&ZCMD = 'MLYR')
  &ZCMD = 'MEMLIST : YEAR'
IF (&ZCMD = 'SORTPDC')
  &ZCMD = 'SORT ?'
IF (&ZCMD = 'FINDPDC')
  &ZCMD = 'F ?'
IF (&ZCMD = 'CONTAPDC')
  &ZCMD = 'CONTROL ALL'
IF (&ZCMD = 'USAGAPDC')
  &ZCMD = 'USAGE ALL'
IF (&ZCMD = 'CONTGPDC')
  &ZCMD = 'CONTROL GEO'
IF (&ZCMD = 'EXCLALL')
  &ZCMD = 'X ALL'
IF (&ZCMD = 'EXCLUP')
  &ZCMD = 'X UP'
IF (&ZCMD = 'EXCLDN')
  &ZCMD = 'X DN'
IF (&ZCMD = 'CHGMENU')
  &ZCMD = 'O.UT.CHGMENU'
IF (&ZCMD = 'N1')
  &ZCMD = 1
IF (&ZCMD = 'N2')
  &ZCMD = 2
IF (&ZCMD = 'N3')
  &ZCMD = 3
IF (&ZCMD = 'N4')
  &ZCMD = 4
IF (&ZCMD = 'N5')
  &ZCMD = 5
IF (&ZCMD = 'N6')
  &ZCMD = 6
IF (&ZCMD = 'N7')
  &ZCMD = 7
IF (&ZCMD = 'N8')
  &ZCMD = 8
IF (&ZCMD = 'N9')
  &ZCMD = 9
IF (&ZCMD = 'NAME')
  IF (&ZPSMLL1 = '')
    &ZCMD = 'SORT NAME ASCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL1 = 1
  ELSE
    &ZCMD = 'SORT NAME DESCENDING'
    &ZPSMLL1 = ''
IF (&ZCMD = 'CREATED')
  IF (&ZPSMLL2 = '')
    &ZCMD = 'SORT LENLKED  DESCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL2 = 1
  ELSE
    &ZCMD = 'SORT LENLKED ASCENDING'
    &ZPSMLL2 = ''
IF (&ZCMD = 'LENGTH')
  IF (&ZPSMLL3 = '')
    &ZCMD = 'SORT LENGTH DESCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL3 = 1
  ELSE
    &ZCMD = 'SORT LENGTH ASCENDING'
    &ZPSMLL3 = ''
IF (&ZCMD = 'TTR')
  IF (&ZPSMLL4 = '')
    &ZCMD = 'SORT TTR ASCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL4 = 1
  ELSE
    &ZCMD = 'SORT TTR DESCENDING'
    &ZPSMLL4 = ''
IF (&ZCMD = 'LMATTR')
  IF (&ZPSMLL5 = '')
    &ZCMD = 'SORT ATTR ASCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL5 = 1
  ELSE
    &ZCMD = 'SORT ATTR DESCENDING'
    &ZPSMLL5 = ''
IF (&ZCMD = 'AUTH')
  IF (&ZPSMLL6 = '')
    &ZCMD = 'SORT AUTH ASCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL6 = 1
  ELSE
    &ZCMD = 'SORT AUTH DESCENDING'
    &ZPSMLL6 = ''
IF (&ZCMD = 'MAIN')
  IF (&ZPSMLL7 = '')
    &ZCMD = 'SORT MAIN ASCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL7 = 1
  ELSE
    &ZCMD = 'SORT MAIN DESCENDING'
    &ZPSMLL7 = ''
IF (&ZCMD = 'MODE')
  IF (&ZPSMLL8 = '')
    &ZCMD = 'SORT MODE ASCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL8 = 1
  ELSE
    &ZCMD = 'SORT MODE DESCENDING'
    &ZPSMLL8 = ''

/* Start NRETRIEV code */
VGET (ZVERB)
.NRET = OFF
IF (&ZVERB = NRETRIEV)
  .NRET = DSN
  IF (&ZNRDS = YES)
    &ZCMD = 'C &ZNRODSN'
    .MSG = ISRDS014
  ELSE .MSG = ISRDS012
/* End NRETRIEV code */

/* Start RefList code */
VGET (ZRDSN ZRVOL) SHARED
IF (&ZRDSN ¬= ' ')
  VGET (ZREFVOLM) PROFILE
  IF (&ZREFVOLM = 'ON')
    &VOL1 = &ZRVOL
  ELSE                                                  /* OW15849*/
    &VOL1 = &Z                                          /* OW15849*/
  IF (&VOL1 = ' ')
    &ZCMD = 'C &ZRDSN'
  ELSE
    &ZCMD = 'C &ZRDSN VOL(&VOL1)'
  &ZDSVOL = &VOL1
  &ZRDSN = ' '
  &ZRVOL = ' '
  VPUT (ZRDSN ZRVOL) SHARED
  VPUT (ZDSVOL) SHARED
  VGET (ZELIST) PROFILE
  IF (&ZELIST ¬= 'EXECUTE') .MSG = ISRDS003
VGET (DSALSEL) SHARED
IF (&DSALSEL ¬= ' ')
  VGET (DSA1,DSA2,DSA6,DSA7) SHARED
  IF (&DSA7 = ' ')
    &ZCMD = 'C ''&DSA1..&DSA2..&DSA6'''
  ELSE
    &ZCMD = 'C ''&DSA1..&DSA2..&DSA6'';ML &DSA7'
  &DSALSEL = ' '
  VPUT (DSALSEL) SHARED
  VGET (ZELIST) PROFILE
  IF (&ZELIST ¬= 'EXECUTE') .MSG = ISRDS003
/* End RefList code */

&PPRE = TRUNC(&ZCMD,3)
IF (&PPRE = 'c ''' OR           /* cHANGE ' command?     */
    &PPRE = 'C ''')             /* Change ' command?     */
  &PDSN = TRUNC(&ZCMD,2)
  &PDSN = .TRAIL
  &PFC = TRUNC(&PDSN,1)         /* If first character    */
  IF (&PFC = '''')              /*   of DSN is "'" check */
    &PREM = .TRAIL              /*   to see if last "'"  */
    &PREM2 = TRUNC(&PREM,'''')  /*   is missing.         */
    IF (&PREM2 = &PREM)         /* If last "'" missing   */
      &ZCMD = '&ZCMD&PFC'       /*   add it to the end.  */

&PPRE = TRUNC(&ZCMD,4)
IF (&PPRE = 'ch ''' OR          /* ch-ANGE ' command?    */
    &PPRE = 'CH ''')            /* CH-ange ' command?    */
  &PDSN = TRUNC(&ZCMD,3)
  &PDSN = .TRAIL
  &PFC = TRUNC(&PDSN,1)         /* If first character    */
  IF (&PFC = '''')              /*   of DSN is "'" check */
    &PREM = .TRAIL              /*   to see if last "'"  */
    &PREM2 = TRUNC(&PREM,'''')  /*   is missing.         */
    IF (&PREM2 = &PREM)         /* If last "'" missing   */
      &ZCMD = '&ZCMD&PFC'       /*   add it to the end.  */

&PPRE = TRUNC(&ZCMD,5)
IF (&PPRE = 'cha ''' OR         /* cha-NGE ' command?    */
    &PPRE = 'CHA ''')           /* CHA-nge ' command?    */
  &PDSN = TRUNC(&ZCMD,4)
  &PDSN = .TRAIL
  &PFC = TRUNC(&PDSN,1)         /* If first character    */
  IF (&PFC = '''')              /*   of DSN is "'" check */
    &PREM = .TRAIL              /*   to see if last "'"  */
    &PREM2 = TRUNC(&PREM,'''')  /*   is missing.         */
    IF (&PREM2 = &PREM)         /* If last "'" missing   */
      &ZCMD = '&ZCMD&PFC'       /*   add it to the end.  */
)PNTS
FIELD(name)     VAR(ZCMD) VAL('SORT NAME')
FIELD(create)   VAR(ZCMD) VAL('SORT LKED')
FIELD(lmattr)   VAR(ZCMD) VAL('SORT ATTR')
FIELD(ac)       VAR(ZCMD) VAL('SORT AUTH')
FIELD(mode)     VAR(ZCMD) VAL('SORT MODE')
FIELD(main)     VAR(ZCMD) VAL('SORT MAIN')
)END
./ ADD NAME=P86PN8PS 0128-98282-16224-0732-00419-00037-00000-T311LBD 13
)ATTR DEFAULT(%+_)
    # TYPE(AB)    FORMAT(MIX)
    " TYPE(ABSL) GE(ON)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    ¬ TYPE(OUTPUT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
    @ TYPE(OUTPUT) INTENS(LOW)
    } TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW) SKIP(ON) HILITE(USCORE)
    $ type(output) intens(high) caps(off) just(asis) pas(on) hilite(uscore)
)ABC DESC('Memlist') MNEM(1)
PDC DESC('All Members') MNEM(13)
 ACTION RUN(MLALL)
PDC DESC('Members Updated Today') MNEM(13)
 ACTION RUN(MLTO)
PDC DESC('Members Updated Yesterday') MNEM(13)
 ACTION RUN(MLYES)
PDC DESC('Members Updated Last 7 days') MNEM(13)
 ACTION RUN(MLWE)
PDC DESC('Members Updated Last 30 days') MNEM(13)
 ACTION RUN(MLMON)
PDC DESC('Members Updated Last 90 days') MNEM(13)
 ACTION RUN(MLQTR)
PDC DESC('Members Updated Last 365 days') MNEM(13)
 ACTION RUN(MLYR)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Functions') MNEM(1)
PDC DESC('List Allocations') MNEM(6)
 ACTION RUN(LA)
PDC DESC('List Volumes...') MNEM(6)
 ACTION RUN(LV)
PDC DESC('List Files...') MNEM(6)
 ACTION RUN(LF)
PDC DESC('Active Catalog List') MNEM(3)
 ACTION RUN(CAX)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Function Menu...') MNEM(10)
 ACTION RUN(FN)
PDC DESC('Function Status') MNEM(10)
 ACTION RUN(FU)
PDC DESC('PDS TSO Command Table') MNEM(7)
 ACTION RUN(TCT)
PDC DESC('Last 30 Referenced DSNAMEs') MNEM(7)
 ACTION RUN(REFLISTD)
PDC DESC('End PDS Session') MNEM(3)
 ACTION RUN(QUIT)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Options') MNEM(1)
PDC DESC('Subcommand Selection...') MNEM(3)
 ACTION RUN(O)
PDC DESC('PDS Generation Options') MNEM(3)
 ACTION RUN(CONTAPDC)
PDC DESC('IBM System Information') MNEM(3)
 ACTION RUN(CPU)
PDC DESC('Dataset Usage') MNEM(3)
 ACTION RUN(USAGAPDC)
PDC DESC('Change Datasets') MNEM(1)
 ACTION RUN(CHANGE)
PDC DESC('Change Dataset Menu...') MNEM(2)
 ACTION RUN(CHGMENU)
PDC DESC('Michael Theys Date Calendar...') MNEM(2)
 ACTION RUN(RCQDATE)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Special') MNEM(1)
PDC DESC('Suspend ISPF') MNEM(4)
 ACTION RUN(N1)
PDC DESC('Clear Table') MNEM(5)
 ACTION RUN(N2)
PDC DESC('Reserved') UNAVAIL(OPT3) MNEM(5)
 ACTION RUN(N3)
PDC DESC('Sublist = Memlist') MNEM(9)
 ACTION RUN(N4)
PDC DESC('Check Aliases') MNEM(9)
 ACTION RUN(N5)
PDC DESC('MEMLIST All') MNEM(9)
 ACTION RUN(N6)
PDC DESC('Output Table...') MNEM(3)
 ACTION RUN(N7)
PDC DESC('View Log') MNEM(6)
 ACTION RUN(N8)
PDC DESC('Swap Panels') MNEM(6)
 ACTION RUN(N9)
PDC DESC('Sort Table...') MNEM(4)
 ACTION RUN(SORTPDC)
PDC DESC('Find in Table...') MNEM(4)
 ACTION RUN(FINDPDC)
PDC DESC('Exclude All') MNEM(10)
 ACTION RUN(EXCLALL)
PDC DESC('Exclude Above') MNEM(10)
 ACTION RUN(EXCLUP)
PDC DESC('Exclude Below') MNEM(10)
 ACTION RUN(EXCLDN)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Defaults') MNEM(1)
PDC DESC('Set Environmental Options') MNEM(6)
 ACTION RUN(SETENV)
PDC DESC('Set Select Alias Commands') MNEM(6)
 ACTION RUN(SETSEL)
PDC DESC('Set Log Limit Values') MNEM(6)
 ACTION RUN(SETLOG)
PDC DESC('Set Member List Options') MNEM(6)
 ACTION RUN(SETML)
PDC DESC('Set LISTV Options') MNEM(6)
 ACTION RUN(SETV)
PDC DESC('Set LISTC Options') MNEM(6)
 ACTION RUN(SETLF)
PDC DESC('Set TRAP Options') MNEM(6)
 ACTION RUN(SETTRAP)
)ABCINIT
.ZVARS=ZCMD
)ABC DESC('Help') MNEM(1)
PDC PDCTEXT('MEMLIST Load Member List')
 ACTION RUN(HELP)
PDC PDCTEXT('PDS Full-screen Help')
 ACTION RUN(TSO) PARM('HEL PDS86')
PDC PDCTEXT('PDS Tutorial Directory')
 ACTION RUN(TUTOR) PARM('P86PN@PO')
PDC PDCTEXT('PDS Quick Reference')
 ACTION RUN(QR)
PDC PDCTEXT('PDS Modifications')
 ACTION RUN(MODS)
PDC PDCTEXT('IBM Product Codes for Compilers')
 ACTION RUN(TRANS)
PDC PDCTEXT('DASD Geometry Chart')
 ACTION RUN(CONTGPDC)
PDC PDCTEXT('Undocumented Items')
 ACTION RUN(TUTOR) PARM('P86UNDOC')
PDC PDCTEXT('About PDS...')
 ACTION RUN(TUTOR) PARM('P86LOGO')
PDC PDCTEXT('PDS Birthday')
 ACTION RUN(TUTOR) PARM('P86BIRTH')
)ABCINIT
.ZVARS=ZCMD
)BODY EXPAND(\\)
%# Memlist# Functions# Options# Special# Defaults# Help+
"-------------------------------------------------------------------------------
+\ \¢MEMLIST Load Member List 2+\ \
%Command ===>¦ZCMD                                            %Scroll ===>_Z   +
Enter an ISPF command a PDS subcommand or a special control code:
%&PDSMSG  ----------------------------------------------------------------------
}CMD $name    }DATA    +ALIASOF $ttr   + $main+   MATCH  $length+ ENTRY   SSI
)MODEL
_Z   ¬Z       _Z       @Z       @Z     @Z       @Z       @Z     @Z     @Z
)INIT
   &OPT3 = 1
   .NRET = ON
   .HELP  = P86PN8@
   .ZVARS = '(ZSCBR MEMLOPT  MEMLNAME MEMLDATA MEMLALIS MEMLTTR  +
            MEMLMNAM MEMLMTTR MEMLLENG MEMLENTY MEMLSSI)'
 &name    = 'NAME'
 &ttr     = ' TTR'
 &main    = 'MAIN'
 &length  = 'LENGTH'
)REINIT
   .NRET = ON
   REFRESH(*)
)PROC
IF (&ZCMD = 'MLALL')
  &ZCMD = 'MEMLIST :'
IF (&ZCMD = 'MLTO')
  &ZCMD = 'MEMLIST : TODAY'
IF (&ZCMD = 'MLYES')
  &ZCMD = 'MEMLIST : YESTERDAY'
IF (&ZCMD = 'MLWE')
  &ZCMD = 'MEMLIST : WEEK'
IF (&ZCMD = 'MLMON')
  &ZCMD = 'MEMLIST : MONTH'
IF (&ZCMD = 'MLQTR')
  &ZCMD = 'MEMLIST : QUARTER'
IF (&ZCMD = 'MLYR')
  &ZCMD = 'MEMLIST : YEAR'
IF (&ZCMD = 'SORTPDC')
  &ZCMD = 'SORT ?'
IF (&ZCMD = 'FINDPDC')
  &ZCMD = 'F ?'
IF (&ZCMD = 'CONTAPDC')
  &ZCMD = 'CONTROL ALL'
IF (&ZCMD = 'USAGAPDC')
  &ZCMD = 'USAGE ALL'
IF (&ZCMD = 'CONTGPDC')
  &ZCMD = 'CONTROL GEO'
IF (&ZCMD = 'EXCLALL')
  &ZCMD = 'X ALL'
IF (&ZCMD = 'EXCLUP')
  &ZCMD = 'X UP'
IF (&ZCMD = 'EXCLDN')
  &ZCMD = 'X DN'
IF (&ZCMD = 'CHGMENU')
  &ZCMD = 'O.UT.CHGMENU'
IF (&ZCMD = 'N1')
  &ZCMD = 1
IF (&ZCMD = 'N2')
  &ZCMD = 2
IF (&ZCMD = 'N3')
  &ZCMD = 3
IF (&ZCMD = 'N4')
  &ZCMD = 4
IF (&ZCMD = 'N5')
  &ZCMD = 5
IF (&ZCMD = 'N6')
  &ZCMD = 6
IF (&ZCMD = 'N7')
  &ZCMD = 7
IF (&ZCMD = 'N8')
  &ZCMD = 8
IF (&ZCMD = 'N9')
  &ZCMD = 9
IF (&ZCMD = 'NAME')
  IF (&ZPSMLL1 = '')
    &ZCMD = 'SORT NAME ASCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL1 = 1
  ELSE
    &ZCMD = 'SORT NAME DESCENDING'
    &ZPSMLL1 = ''
IF (&ZCMD = 'CREATED')
  IF (&ZPSMLL2 = '')
    &ZCMD = 'SORT LENLKED  DESCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL2 = 1
  ELSE
    &ZCMD = 'SORT LENLKED ASCENDING'
    &ZPSMLL2 = ''
IF (&ZCMD = 'LENGTH')
  IF (&ZPSMLL3 = '')
    &ZCMD = 'SORT LENGTH DESCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL3 = 1
  ELSE
    &ZCMD = 'SORT LENGTH ASCENDING'
    &ZPSMLL3 = ''
IF (&ZCMD = 'TTR')
  IF (&ZPSMLL4 = '')
    &ZCMD = 'SORT TTR ASCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL4 = 1
  ELSE
    &ZCMD = 'SORT TTR DESCENDING'
    &ZPSMLL4 = ''
IF (&ZCMD = 'LMATTR')
  IF (&ZPSMLL5 = '')
    &ZCMD = 'SORT ATTR ASCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL5 = 1
  ELSE
    &ZCMD = 'SORT ATTR DESCENDING'
    &ZPSMLL5 = ''
IF (&ZCMD = 'AUTH')
  IF (&ZPSMLL6 = '')
    &ZCMD = 'SORT AUTH ASCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL6 = 1
  ELSE
    &ZCMD = 'SORT AUTH DESCENDING'
    &ZPSMLL6 = ''
IF (&ZCMD = 'MAIN')
  IF (&ZPSMLL7 = '')
    &ZCMD = 'SORT MAIN ASCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL7 = 1
  ELSE
    &ZCMD = 'SORT MAIN DESCENDING'
    &ZPSMLL7 = ''
IF (&ZCMD = 'MODE')
  IF (&ZPSMLL8 = '')
    &ZCMD = 'SORT MODE ASCENDING'
    &ZPSMLL1 = ''     /*      NAME          */
    &ZPSMLL2 = ''     /*      CREATED       */
    &ZPSMLL3 = ''     /*      LENGTH        */
    &ZPSMLL4 = ''     /*      TTR           */
    &ZPSMLL5 = ''     /*      ATTR          */
    &ZPSMLL6 = ''     /*      AUTH          */
    &ZPSMLL7 = ''     /*      MAIN          */
    &ZPSMLL8 = ''     /*      MODE          */
    &ZPSMLL8 = 1
  ELSE
    &ZCMD = 'SORT MODE DESCENDING'
    &ZPSMLL8 = ''

/* Start NRETRIEV code */
VGET (ZVERB)
.NRET = OFF
IF (&ZVERB = NRETRIEV)
  .NRET = DSN
  IF (&ZNRDS = YES)
    &ZCMD = 'C &ZNRODSN'
    .MSG = ISRDS014
  ELSE .MSG = ISRDS012
/* End NRETRIEV code */

/* Start RefList code */
VGET (ZRDSN ZRVOL) SHARED
IF (&ZRDSN ¬= ' ')
  VGET (ZREFVOLM) PROFILE
  IF (&ZREFVOLM = 'ON')
    &VOL1 = &ZRVOL
  ELSE                                                  /* OW15849*/
    &VOL1 = &Z                                          /* OW15849*/
  IF (&VOL1 = ' ')
    &ZCMD = 'C &ZRDSN'
  ELSE
    &ZCMD = 'C &ZRDSN VOL(&VOL1)'
  &ZDSVOL = &VOL1
  &ZRDSN = ' '
  &ZRVOL = ' '
  VPUT (ZRDSN ZRVOL) SHARED
  VPUT (ZDSVOL) SHARED
  VGET (ZELIST) PROFILE
  IF (&ZELIST ¬= 'EXECUTE') .MSG = ISRDS003
VGET (DSALSEL) SHARED
IF (&DSALSEL ¬= ' ')
  VGET (DSA1,DSA2,DSA6,DSA7) SHARED
  IF (&DSA7 = ' ')
    &ZCMD = 'C ''&DSA1..&DSA2..&DSA6'''
  ELSE
    &ZCMD = 'C ''&DSA1..&DSA2..&DSA6'';ML &DSA7'
  &DSALSEL = ' '
  VPUT (DSALSEL) SHARED
  VGET (ZELIST) PROFILE
  IF (&ZELIST ¬= 'EXECUTE') .MSG = ISRDS003
/* End RefList code */

&PPRE = TRUNC(&ZCMD,3)
IF (&PPRE = 'c ''' OR           /* cHANGE ' command?     */
    &PPRE = 'C ''')             /* Change ' command?     */
  &PDSN = TRUNC(&ZCMD,2)
  &PDSN = .TRAIL
  &PFC = TRUNC(&PDSN,1)         /* If first character    */
  IF (&PFC = '''')              /*   of DSN is "'" check */
    &PREM = .TRAIL              /*   to see if last "'"  */
    &PREM2 = TRUNC(&PREM,'''')  /*   is missing.         */
    IF (&PREM2 = &PREM)         /* If last "'" missing   */
      &ZCMD = '&ZCMD&PFC'       /*   add it to the end.  */

&PPRE = TRUNC(&ZCMD,4)
IF (&PPRE = 'ch ''' OR          /* ch-ANGE ' command?    */
    &PPRE = 'CH ''')            /* CH-ange ' command?    */
  &PDSN = TRUNC(&ZCMD,3)
  &PDSN = .TRAIL
  &PFC = TRUNC(&PDSN,1)         /* If first character    */
  IF (&PFC = '''')              /*   of DSN is "'" check */
    &PREM = .TRAIL              /*   to see if last "'"  */
    &PREM2 = TRUNC(&PREM,'''')  /*   is missing.         */
    IF (&PREM2 = &PREM)         /* If last "'" missing   */
      &ZCMD = '&ZCMD&PFC'       /*   add it to the end.  */

&PPRE = TRUNC(&ZCMD,5)
IF (&PPRE = 'cha ''' OR         /* cha-NGE ' command?    */
    &PPRE = 'CHA ''')           /* CHA-nge ' command?    */
  &PDSN = TRUNC(&ZCMD,4)
  &PDSN = .TRAIL
  &PFC = TRUNC(&PDSN,1)         /* If first character    */
  IF (&PFC = '''')              /*   of DSN is "'" check */
    &PREM = .TRAIL              /*   to see if last "'"  */
    &PREM2 = TRUNC(&PREM,'''')  /*   is missing.         */
    IF (&PREM2 = &PREM)         /* If last "'" missing   */
      &ZCMD = '&ZCMD&PFC'       /*   add it to the end.  */
)PNTS
FIELD(name    ) VAR(ZCMD) VAL('SORT NAME')
FIELD(ttr     ) VAR(ZCMD) VAL('SORT TTR')
FIELD(main    ) VAR(ZCMD) VAL('SORT MAIN')
FIELD(length  ) VAR(ZCMD) VAL('SORT LENGTH')
)END
./ ADD NAME=P86SET@  0111-97337-16236-0915-00063-00047-00000-T311LBD 49
)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
    $ type(output) intens(high) caps(off) just(left) pas(on) hilite(uscore)
)BODY EXPAND(\\)
+-\-\-¢PDS Set Default Selection+-\-\-
%OPTION  ===>_ZCMD
+
+
 Choose one of the following (point-and-shoot):
+
    $SETENV+ +- Set default environmental options
    $SETSEL+ +- Set default select alias commands
    $SETLOG+ +- Set default Log limit values
    $SETML+  +- Set default member list options
    $SETV+   +- Set default LISTV options
    $SETLF+  +- Set default LISTFILE/LISTC options
    $SETTRAP++- Set default TRAP options
)INIT
 .HELP = P86SET@P
 &setenv  = 'SETENV'
 &setsel  = 'SETSEL'
 &setlog  = 'SETLOG'
 &setml   = 'SETML'
 &setv    = 'SETV'
 &setlf   = 'SETLF'
 &settrap = 'SETTRAP'
)PROC
 &PDSZSEL=TRANS(TRUNC(&ZCMD,'.')
        SETENV,'SETENV'
         SETEN,'SETENV'
          SETE,'SETENV'
        SETSEL,'SETSEL'
         SETSE,'SETSEL'
          SETS,'SETSEL'
        SETLOG,'SETLOG'
         SETLO,'SETLOG'
          SETL,'SETLOG'
         SETLF,'SETLF'
         SETML,'SETML'
          SETM,'SETML'
          SETV,'SETV'
       SETTRAP,'SETTRAP'
        SETTRA,'SETTRAP'
         SETTR,'SETTRAP'
          SETT,'SETTRAP'
           ' ',' '
             *,'?')
 &ZTRAIL=.TRAIL
 &OPERS=.TRAIL
)PNTS
FIELD(setenv  ) VAR(ZCMD) VAL(SETENV )
FIELD(setsel  ) VAR(ZCMD) VAL(SETSEL )
FIELD(setlog  ) VAR(ZCMD) VAL(SETLOG )
FIELD(setml   ) VAR(ZCMD) VAL(SETML  )
FIELD(setv    ) VAR(ZCMD) VAL(SETV   )
FIELD(setlf   ) VAR(ZCMD) VAL(SETLF  )
FIELD(settrap ) VAR(ZCMD) VAL(SETTRAP)
)END
