)ATTR
  ~  TYPE(OUTPUT) CAPS(OFF) COLOR(TURQ) JUST(ASIS)
  @  TYPE(OUTPUT) CAPS(OFF) COLOR(BLUE)
)BODY WINDOW(65,17)

 @h1

 ~l1
 ~l2
 ~l3
 ~l4
 ~l5
 ~l6
 ~l7
 ~l8
 ~l9
 ~l10
 ~l11
 ~l12
 ~l13
)INIT
  &ZWINTTL = 'Data Set Information'
)END
