)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
%TUTORIAL  +-\-\-¢PDS MEMLIST Load Block Commands+-\-\-
%OPTION  ===>_ZCMD                                                             +

  The following doubled letters may be used to delimit block line commands:
    %AA+-+Attrib
    %BB+-+Browse
    %DD+-+Direntry
    %HH+-+History
    %LL+-+List
    %MM+-+Map
    %OO+-+O line command for option list
    %SS+-+Select (normally Browse)
    %XX+-+Drop from member list
    %==+-+Repeat last line command
)END
